#
# Karel
# Copyright (C) 2014-2015 Jaroslav Tulach <jaroslav.tulach@apidesign.org>
#
# This program is free software: you can redistribute it and/or modify
# it under the terms of the GNU General Public License as published by
# the Free Software Foundation, version 2 of the License.
#
# This program is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
# GNU General Public License for more details.
#
# You should have received a copy of the GNU General Public License
# along with this program. Look for COPYING file in the top folder.
# If not, see http://opensource.org/licenses/GPL-2.0.
#


HARDCODED_StartText=\u0397 Karla \u03c4\u03bf \u03c1\u03bf\u03bc\u03c0\u03cc\u03c4 \u03ad\u03c7\u03b5\u03b9 \u03c7\u03b1\u03b8\u03b5\u03af \u03c3\u03b5 \u03ad\u03bd\u03b1 \u03c4\u03b5\u03c1\u03ac\u03c3\u03c4\u03b9\u03bf \u03ba\u03c4\u03af\u03c1\u03b9\u03bf \u03ba\u03b1\u03b9 \u03c7\u03c1\u03b5\u03b9\u03ac\u03b6\u03b5\u03c4\u03b1\u03b9 \u03b2\u03bf\u03ae\u03b8\u03b5\u03b9\u03b1 \u03b3\u03b9\u03b1 \u03bd\u03b1 \u03b2\u03b3\u03b5\u03b9 \u03ad\u03be\u03c9. \u0398\u03b1 \u03c4\u03b7 \u03b2\u03bf\u03b7\u03b8\u03ae\u03c3\u03b5\u03c4\u03b5;
HARDCODED_StartCommand=\u0395\u03af\u03bc\u03b1\u03b9 \u03c3\u03b5 \u03b1\u03c5\u03c4\u03cc!
HARDCODED_TryAgain=\u0395\u03c0\u03b1\u03bd\u03ac\u03bb\u03b7\u03c8\u03b7
HARDCODED_NextRoom=\u0395\u03c0\u03cc\u03bc\u03b5\u03bd\u03bf \u03b4\u03c9\u03bc\u03ac\u03c4\u03b9\u03bf &raquo;
HARDCODED_Go=Go!
HARDCODED_GoHint=(\u0395\u03ba\u03c4\u03ad\u03bb\u03b5\u03c3\u03b5 \u03c4\u03b7\u03bd \u03b5\u03bd\u03c4\u03bf\u03bb\u03ae {0})
HARDCODED_Stop=Stop
HARDCODED_GiveUp=I give up, show me a solution!
HARDCODED_DidntReachExit=Eh, nedo\u0161la jsem v v\u00fdchodu. Pros\u00edm, zkus to znovu!
HARDCODED_HINT=\u03a3\u03a5\u039c\u0392\u039f\u03a5\u039b\u0397:

Error_Wall=<strong>Auu!</strong> I ran into the wall!
Error_NoMarks=<strong>Error!</strong> No mark to pick up!
Error_TooManyMarks=<strong>Error!</strong> Too many marks!
Error_UnknowCommand=<strong>Error!</strong> Unknown command {0}!
Error_unknown=<strong>Error!</strong> Unknown error!

DESC_00=<p>\u03a7\u03c1\u03b5\u03b9\u03ac\u03b6\u03bf\u03bc\u03b1\u03b9 \u03c4\u03b7 \u03b2\u03bf\u03ae\u03b8\u03b5\u03b9\u03ac \u03c3\u03bf\u03c5!</p>\
        <p>\u0395\u03af\u03bc\u03b1\u03b9 \u03c4\u03bf \u03c1\u03bf\u03bc\u03c0\u03cc\u03c4 \u039a\u03ac\u03c1\u03bb\u03b1 \u03ba\u03b1\u03b9 \u03c7\u03ac\u03b8\u03b7\u03ba\u03b1 \u03c3\u03b5 \u03b1\u03c5\u03c4\u03cc \u03c4\u03bf \u03ba\u03c4\u03af\u03c1\u03b9\u03bf. \u03a4\u03b1 \u03ba\u03c5\u03ba\u03bb\u03ce\u03bc\u03b1\u03c4\u03b1 \u03c0\u03bb\u03bf\u03ae\u03b3\u03b7\u03c3\u03ae\u03c2 \u03bc\u03bf\u03c5 \u03ad\u03c7\u03bf\u03c5\u03bd \u03c3\u03c0\u03ac\u03c3\u03b5\u03b9, \u03b5\u03c0\u03bf\u03bc\u03ad\u03bd\u03c9\u03c2 \u03b4\u03b5\u03bd \u03bc\u03c0\u03bf\u03c1\u03ce \u03bd\u03b1 \u03c0\u03bb\u03bf\u03b7\u03b3\u03b7\u03b8\u03ce \u03c3\u03c9\u03c3\u03c4\u03ac.</p>\
        <p>\u039c\u03c0\u03bf\u03c1\u03b5\u03af\u03c4\u03b5 \u03bd\u03b1 \u03c7\u03c1\u03b7\u03c3\u03b9\u03bc\u03bf\u03c0\u03bf\u03b9\u03ae\u03c3\u03b5\u03c4\u03b5 \u03c4\u03b9\u03c2 \u03b5\u03bd\u03c4\u03bf\u03bb\u03ad\u03c2 \u03ba\u03b1\u03b9 \u03bd\u03b1 \u03bc\u03b5 \u03ba\u03b1\u03b8\u03bf\u03b4\u03b7\u03b3\u03ae\u03c3\u03b5\u03c4\u03b5 \u03c3\u03c4\u03b7\u03bd \u03ad\u03be\u03bf\u03b4\u03bf;</p>
HINT_00=\u03a7\u03c1\u03b7\u03c3\u03b9\u03bc\u03bf\u03c0\u03bf\u03b9\u03ae\u03c3\u03c4\u03b5 \u03c4\u03b9\u03c2 \u03b5\u03bd\u03c4\u03bf\u03bb\u03ad\u03c2 'turn-left' \u03ba\u03b1\u03b9 'move' \u03b3\u03b9\u03b1 \u03bd\u03b1 \u03bc\u03b5\u03c4\u03b1\u03ba\u03b9\u03bd\u03ae\u03c3\u03b5\u03c4\u03b5 \u03c4\u03b7\u03bd Karla \u03c3\u03c4\u03b7\u03bd \u03ad\u03be\u03bf\u03b4\u03bf. \u03a3\u03b7\u03bc\u03b5\u03b9\u03ce\u03c3\u03c4\u03b5 \u03cc\u03c4\u03b9 \u03b7 \u039a\u03ac\u03c1\u03bb\u03b1 \u03b4\u03b5\u03bd \u03bc\u03c0\u03bf\u03c1\u03b5\u03af \u03bd\u03b1 \u03bc\u03c0\u03b5\u03b9 \u03c3\u03c4\u03bf\u03c5\u03c2 \u03c4\u03bf\u03af\u03c7\u03bf\u03c5\u03c2!
DESC_01=<p>\u039f\u03c5\u03c6, \u03b5\u03c5\u03c7\u03b1\u03c1\u03b9\u03c3\u03c4\u03ce \u03c0\u03bf\u03c5 \u03bc\u03b5 \u03b2\u03bf\u03ae\u03b8\u03b7\u03c3\u03b5\u03c2 \u03bd\u03b1 \u03b2\u03b3\u03c9 \u03b1\u03c0\u03cc \u03c4\u03bf \u03b4\u03c9\u03bc\u03ac\u03c4\u03b9\u03bf.</p>\
        <p>\u0395\u03af\u03bc\u03b1\u03b9 \u03c3\u03b5 \u03ac\u03bb\u03bb\u03bf \u03b4\u03c9\u03bc\u03ac\u03c4\u03b9\u03bf \u03c4\u03ce\u03c1\u03b1. \u03a6\u03bf\u03b2\u03ac\u03bc\u03b1\u03b9 \u03cc\u03c4\u03b9 \u03b8\u03b1 \u03c7\u03c1\u03b5\u03b9\u03b1\u03c3\u03c4\u03ce \u03c4\u03b7 \u03b2\u03bf\u03ae\u03b8\u03b5\u03b9\u03ac \u03c3\u03bf\u03c5 \u03b3\u03b9\u03b1 \u03bd\u03b1 \u03b2\u03b3\u03c9 \u03cc\u03c7\u03b9 \u03bc\u03cc\u03bd\u03bf \u03b1\u03c0\u03cc \u03b1\u03c5\u03c4\u03cc \u03c4\u03bf \u03b4\u03c9\u03bc\u03ac\u03c4\u03b9\u03bf, \u03b1\u03bb\u03bb\u03ac \u03b3\u03b9\u03b1 \u03bd\u03b1 \u03c0\u03b5\u03c1\u03ac\u03c3\u03c9 \u03b1\u03c0\u03cc \u03bc\u03b9\u03b1 \u03c3\u03b5\u03b9\u03c1\u03ac \u03b1\u03c0\u03cc \u03b4\u03c9\u03bc\u03ac\u03c4\u03b9\u03b1, \u03b3\u03b9\u03b1 \u03bd\u03b1 \u03b2\u03b3\u03c9 \u03b1\u03c0\u03cc \u03b1\u03c5\u03c4\u03cc \u03c4\u03bf \u03ba\u03c4\u03af\u03c1\u03b9\u03bf.</p>\
        <p>\u0395\u03c0\u03af\u03c3\u03b7\u03c2, \u03c5\u03c0\u03ac\u03c1\u03c7\u03bf\u03c5\u03bd \u03c0\u03bf\u03bb\u03bb\u03ad\u03c2 \u03c0\u03b1\u03c1\u03b5\u03bc\u03b2\u03bf\u03bb\u03ad\u03c2 \u03b5\u03b4\u03ce, \u03c6\u03bf\u03b2\u03ac\u03bc\u03b1\u03b9 \u03cc\u03c4\u03b9 \u03b4\u03b5\u03bd \u03bc\u03c0\u03bf\u03c1\u03b5\u03af\u03c2 \u03c0\u03bb\u03ad\u03bf\u03bd \u03bd\u03b1 \u03bc\u03bf\u03c5 \u03b4\u03ce\u03c3\u03b5\u03b9\u03c2 \u03b5\u03bd\u03c4\u03bf\u03bb\u03ad\u03c2 \u03bc\u03af\u03b1 \u03c0\u03c1\u03bf\u03c2 \u03bc\u03af\u03b1. \u0398\u03b1 \u03c7\u03c1\u03b5\u03b9\u03b1\u03c3\u03c4\u03b5\u03af \u03bd\u03b1 \u03bc\u03bf\u03c5 \u03b4\u03ce\u03c3\u03b5\u03b9\u03c2 \u03bc\u03b9\u03b1 \u03bb\u03af\u03c3\u03c4\u03b1 \u03b5\u03bd\u03c4\u03bf\u03bb\u03ce\u03bd \u03c0\u03bf\u03c5 \u03bd\u03b1 \u03bc\u03c0\u03bf\u03c1\u03ce \u03bd\u03b1 \u03b1\u03ba\u03bf\u03bb\u03bf\u03c5\u03b8\u03ae\u03c3\u03c9.</p>\
        <p>\u0395\u03c5\u03c4\u03c5\u03c7\u03ce\u03c2, \u03ad\u03bd\u03b1 \u03bc\u03ad\u03c1\u03bf\u03c2 \u03c4\u03b7\u03c2 \u03cc\u03c1\u03b1\u03c3\u03ae\u03c2 \u03bc\u03bf\u03c5 \u03b4\u03b9\u03b1\u03c4\u03b7\u03c1\u03b5\u03af\u03c4\u03b1\u03b9 \u03b1\u03ba\u03cc\u03bc\u03b1, \u03c0\u03b1\u03c1\u03ac \u03c4\u03b9\u03c2 \u03c0\u03b1\u03c1\u03b5\u03bc\u03b2\u03bf\u03bb\u03ad\u03c2, \u03bf\u03c0\u03cc\u03c4\u03b5 \u03b8\u03b1 \u03b5\u03af\u03bd\u03b1\u03b9 \u03b1\u03c1\u03ba\u03b5\u03c4\u03cc \u03b3\u03b9\u03b1 \u03bd\u03b1 \u03b2\u03b5\u03b2\u03b1\u03b9\u03c9\u03b8\u03ce \u03cc\u03c4\u03b9 \u03c3\u03c4\u03ad\u03ba\u03bf\u03bc\u03b1\u03b9 \u03b4\u03af\u03c0\u03bb\u03b1 \u03c3\u03c4\u03b7\u03bd \u03ad\u03be\u03bf\u03b4\u03bf \u03ba\u03b1\u03b9 \u03c4\u03b7\u03bd \u03b1\u03bd\u03c4\u03b9\u03ba\u03c1\u03af\u03b6\u03c9.</p>
HINT_01=\u03a3\u03b7\u03bc\u03b5\u03b9\u03ce\u03c3\u03c4\u03b5 \u03cc\u03c4\u03b9 \u03b7 \u03ad\u03be\u03bf\u03b4\u03bf\u03c2 \u03b5\u03af\u03bd\u03b1\u03b9 \u03c0\u03af\u03c3\u03c9 \u03b1\u03c0\u03cc \u03c4\u03b7\u03bd \u039a\u03ac\u03c1\u03bb\u03b1. \u0393\u03c5\u03c1\u03af\u03c3\u03c4\u03b5 \u03c4\u03b7\u03bd \u03ad\u03c4\u03c3\u03b9 \u03ce\u03c3\u03c4\u03b5 \u03bd\u03b1 \u03ba\u03bf\u03b9\u03c4\u03ac\u03b6\u03b5\u03b9 \u03c0\u03c1\u03bf\u03c2 \u03c4\u03b1 \u03c0\u03af\u03c3\u03c9. \u039a\u03ac\u03bd\u03c4\u03b5 \u03c4\u03b7 \u03bd\u03b1 \u03c3\u03c4\u03c1\u03af\u03c8\u03b5\u03b9 \u03b1\u03c1\u03b9\u03c3\u03c4\u03b5\u03c1\u03ac. \u03a3\u03c5\u03bc\u03c0\u03bb\u03b7\u03c1\u03ce\u03c3\u03c4\u03b5 \u03c4\u03b9\u03c2 \u03b5\u03bd\u03c4\u03bf\u03bb\u03ad\u03c2 \u03c3\u03c4\u03b7\u03bd \u03c0\u03c1\u03bf-\u03b4\u03b7\u03bc\u03b9\u03bf\u03c5\u03c1\u03b3\u03b7\u03bc\u03ad\u03bd\u03b7 \u03b5\u03bd\u03c4\u03bf\u03bb\u03ae 'turn-back' \u03ba\u03b1\u03b9 \u03c0\u03b1\u03c4\u03ae\u03c3\u03c4\u03b5 GO!
DESC_02=\u039f\u03c5\u03c6, \u03b5\u03c5\u03c7\u03b1\u03c1\u03b9\u03c3\u03c4\u03ce! \u0388\u03bd\u03b1 \u03ac\u03bb\u03bb\u03bf \u03b4\u03c9\u03bc\u03ac\u03c4\u03b9\u03bf, \u03b7 \u03af\u03b4\u03b9\u03b1 \u03b5\u03c1\u03b3\u03b1\u03c3\u03af\u03b1 \u03bc\u03b5 \u03c4\u03b7\u03bd \u03c0\u03c1\u03bf\u03b7\u03b3\u03bf\u03cd\u03bc\u03b5\u03bd\u03b7 \u03c6\u03bf\u03c1\u03ac - \u03bc\u03c0\u03bf\u03c1\u03b5\u03af\u03c4\u03b5 \u03c0\u03b1\u03c1\u03b1\u03ba\u03b1\u03bb\u03ce \u03bd\u03b1 \u03bc\u03b5 \u03b3\u03c5\u03c1\u03af\u03c3\u03b5\u03c4\u03b5 \u03ce\u03c3\u03c4\u03b5 \u03bd\u03b1 \u03ba\u03bf\u03b9\u03c4\u03ac\u03be\u03c9 \u03c0\u03c1\u03bf\u03c2 \u03c4\u03b7\u03bd \u03ad\u03be\u03bf\u03b4\u03bf;
HINT_02=\u03a3\u03b7\u03bc\u03b5\u03b9\u03ce\u03c3\u03c4\u03b5 \u03cc\u03c4\u03b9 \u03b7 \u03ad\u03be\u03bf\u03b4\u03bf\u03c2 \u03b5\u03af\u03bd\u03b1\u03b9 \u03c3\u03c4\u03b1 \u03b4\u03b5\u03be\u03b9\u03ac \u03c4\u03b7\u03c2 \u039a\u03ac\u03c1\u03bb\u03b1\u03c2. \u038c\u03bc\u03c9\u03c2, \u03b7 \u039a\u03ac\u03c1\u03bb\u03b1 \u03b4\u03b5\u03bd \u03ad\u03c7\u03b5\u03b9 \u03b5\u03bd\u03c4\u03bf\u03bb\u03ae \u03bd\u03b1 \u03c3\u03c4\u03c1\u03af\u03c8\u03b5\u03b9 \u03b4\u03b5\u03be\u03b9\u03ac, \u03bc\u03cc\u03bd\u03bf \u03bd\u03b1 \u03c3\u03c4\u03c1\u03af\u03c8\u03b5\u03b9 \u03b1\u03c1\u03b9\u03c3\u03c4\u03b5\u03c1\u03ac. \u03a4\u03bf \u03bd\u03b1 \u03c3\u03c4\u03c1\u03af\u03c8\u03b5\u03c4\u03b5 \u03b4\u03b5\u03be\u03b9\u03ac \u03b5\u03af\u03bd\u03b1\u03b9 \u03c4\u03bf \u03af\u03b4\u03b9\u03bf \u03bc\u03b5 \u03c4\u03bf \u03bd\u03b1 \u03c3\u03c4\u03c1\u03af\u03c8\u03b5\u03c4\u03b5 \u03b1\u03c1\u03b9\u03c3\u03c4\u03b5\u03c1\u03ac \u03c4\u03c1\u03b5\u03b9\u03c2 \u03c6\u03bf\u03c1\u03ad\u03c2. \u039a\u03b1\u03b8\u03bf\u03c1\u03af\u03c3\u03c4\u03b5 \u03c4\u03b7\u03bd \u03b5\u03bd\u03c4\u03bf\u03bb\u03ae \u03ad\u03c4\u03c3\u03b9 \u03ce\u03c3\u03c4\u03b5 \u03bd\u03b1 \u03c3\u03c4\u03c1\u03af\u03c8\u03b5\u03c4\u03b5 \u03c4\u03b7\u03bd Karla \u03b1\u03c1\u03b9\u03c3\u03c4\u03b5\u03c1\u03ac \u03c4\u03c1\u03b5\u03b9\u03c2 \u03c6\u03bf\u03c1\u03ad\u03c2. \u0389, \u03b1\u03ba\u03cc\u03bc\u03b1 \u03ba\u03b1\u03bb\u03cd\u03c4\u03b5\u03c1\u03b1, \u03bf\u03c1\u03af\u03c3\u03c4\u03b5 \u03c4\u03b7\u03bd \u03b5\u03bd\u03c4\u03bf\u03bb\u03ae \u03c7\u03c1\u03b7\u03c3\u03b9\u03bc\u03bf\u03c0\u03bf\u03b9\u03ce\u03bd\u03c4\u03b1\u03c2 \u03be\u03b1\u03bd\u03ac \u03c4\u03b7\u03bd \u03b5\u03bd\u03c4\u03bf\u03bb\u03ae 'turn-back' \u03b1\u03c0\u03cc \u03c4\u03bf \u03c0\u03c1\u03bf\u03b7\u03b3\u03bf\u03cd\u03bc\u03b5\u03bd\u03bf \u03b4\u03c9\u03bc\u03ac\u03c4\u03b9\u03bf: \u03c4\u03bf \u03c3\u03c4\u03c1\u03af\u03c8\u03b9\u03bc\u03bf \u03b4\u03b5\u03be\u03b9\u03ac \u03b5\u03af\u03bd\u03b1\u03b9 \u03c4\u03bf \u03af\u03b4\u03b9\u03bf \u03bc\u03b5 \u03c4\u03bf \u03bd\u03b1 \u03b3\u03c5\u03c1\u03af\u03c3\u03b5\u03c4\u03b5 \u03c0\u03af\u03c3\u03c9 \u03ba\u03b1\u03b9 \u03bc\u03b5\u03c4\u03ac \u03bd\u03b1 \u03c3\u03c4\u03c1\u03af\u03c8\u03b5\u03c4\u03b5 \u03b1\u03c1\u03b9\u03c3\u03c4\u03b5\u03c1\u03ac.
DESC_03=<p>\u03a9\u03c7, \u03ac\u03bb\u03bb\u03bf \u03ad\u03bd\u03b1 \u03b4\u03c9\u03bc\u03ac\u03c4\u03b9\u03bf! \u0395\u03c5\u03c7\u03b1\u03c1\u03b9\u03c3\u03c4\u03ce \u03b3\u03b9\u03b1 \u03c4\u03b7 \u03b2\u03bf\u03ae\u03b8\u03b5\u03b9\u03ac \u03c3\u03bf\u03c5 \u03bc\u03ad\u03c7\u03c1\u03b9 \u03c4\u03ce\u03c1\u03b1!</p>\
         <p>\u03a6\u03bf\u03b2\u03ac\u03bc\u03b1\u03b9 \u03cc\u03c4\u03b9 \u03bf\u03b9 \u03c0\u03b1\u03c1\u03b5\u03bc\u03b2\u03bf\u03bb\u03ad\u03c2 \u03b3\u03af\u03bd\u03bf\u03bd\u03c4\u03b1\u03b9 \u03c7\u03b5\u03b9\u03c1\u03cc\u03c4\u03b5\u03c1\u03b5\u03c2. \u0397 \u03cc\u03c1\u03b1\u03c3\u03ae \u03bc\u03bf\u03c5 \u03b5\u03af\u03bd\u03b1\u03b9 \u03c0\u03bf\u03bb\u03cd \u03b5\u03be\u03b1\u03c3\u03b8\u03b5\u03bd\u03b7\u03bc\u03ad\u03bd\u03b7 \u03c4\u03ce\u03c1\u03b1. \u0395\u03af\u03bc\u03b1\u03b9 \u03c3\u03af\u03b3\u03bf\u03c5\u03c1\u03b7 \u03cc\u03c4\u03b9 \u03b8\u03b1 \u03b2\u03b5\u03bb\u03c4\u03b9\u03c9\u03b8\u03b5\u03af \u03cc\u03c4\u03b1\u03bd \u03b2\u03b3\u03c9 \u03b1\u03c0\u03cc \u03b1\u03c5\u03c4\u03cc \u03c4\u03bf \u03ba\u03c4\u03af\u03c1\u03b9\u03bf. \u0391\u03bb\u03bb\u03ac, \u03c0\u03c1\u03bf\u03c2 \u03c4\u03bf \u03c0\u03b1\u03c1\u03cc\u03bd, \u03c6\u03bf\u03b2\u03ac\u03bc\u03b1\u03b9 \u03cc\u03c4\u03b9 \u03b8\u03b1 \u03c7\u03c1\u03b5\u03b9\u03b1\u03c3\u03c4\u03ce \u03bd\u03b1 \u03bc\u03bf\u03c5 \u03b4\u03ce\u03c3\u03b5\u03b9\u03c2 \u03bf\u03b4\u03b7\u03b3\u03af\u03b5\u03c2 \u03b3\u03b9\u03b1 \u03bd\u03b1 \u03c6\u03c4\u03ac\u03c3\u03c9 \u03c3\u03c4\u03b7\u03bd \u03ad\u03be\u03bf\u03b4\u03bf, \u03cc\u03c7\u03b9 \u03bc\u03cc\u03bd\u03bf \u03bd\u03b1 \u03c3\u03c4\u03b1\u03b8\u03ce \u03b4\u03af\u03c0\u03bb\u03b1 \u03c4\u03b7\u03c2.</p>
HINT_03=\u0397 \u03ad\u03be\u03bf\u03b4\u03bf\u03c2 \u03b5\u03af\u03bd\u03b1\u03b9 \u03b4\u03cd\u03bf \u03c3\u03b5\u03b9\u03c1\u03ad\u03c2 \u03bc\u03c0\u03c1\u03bf\u03c3\u03c4\u03ac \u03b1\u03c0\u03cc \u03c4\u03b7\u03bd \u039a\u03ac\u03c1\u03bb\u03b1. \u0391\u03c0\u03bb\u03ce\u03c2 \u03cc\u03c1\u03b9\u03c3\u03b5 \u03c4\u03b7\u03bd \u03b5\u03bd\u03c4\u03bf\u03bb\u03ae \u03ad\u03c4\u03c3\u03b9 \u03ce\u03c3\u03c4\u03b5 \u03b7 Karla \u03bd\u03b1 \u03ba\u03b9\u03bd\u03b5\u03af\u03c4\u03b1\u03b9 \u03b4\u03cd\u03bf \u03c6\u03bf\u03c1\u03ad\u03c2.
DESC_04=\u0395\u03c5\u03c7\u03b1\u03c1\u03b9\u03c3\u03c4\u03ce \u03c0\u03bf\u03c5 \u03bc\u03b5 \u03ba\u03b1\u03b8\u03bf\u03b4\u03ae\u03b3\u03b7\u03c3\u03b5\u03c2 \u03c3\u03b5 \u03b1\u03c5\u03c4\u03cc \u03c4\u03bf \u03b4\u03c9\u03bc\u03ac\u03c4\u03b9\u03bf! \u039c\u03c0\u03bf\u03c1\u03b5\u03af\u03c2 \u03bd\u03b1 \u03bc\u03b5 \u03ba\u03b1\u03b8\u03bf\u03b4\u03b7\u03b3\u03ae\u03c3\u03b5\u03b9\u03c2 \u03ba\u03b1\u03b9 \u03c3\u03b5 \u03b1\u03c5\u03c4\u03cc \u03c4\u03bf \u03b4\u03c9\u03bc\u03ac\u03c4\u03b9\u03bf;
HINT_04=\u0391\u03c5\u03c4\u03cc \u03b5\u03af\u03bd\u03b1\u03b9 \u03c0\u03b1\u03c1\u03cc\u03bc\u03bf\u03b9\u03bf \u03bc\u03b5 \u03c4\u03bf \u03c0\u03c1\u03bf\u03b7\u03b3\u03bf\u03cd\u03bc\u03b5\u03bd\u03bf \u03b4\u03c9\u03bc\u03ac\u03c4\u03b9\u03bf - \u03b7 \u039a\u03ac\u03c1\u03bb\u03b1 \u03c0\u03c1\u03ad\u03c0\u03b5\u03b9 \u03b1\u03c0\u03bb\u03ce\u03c2 \u03bd\u03b1 \u03c0\u03c1\u03bf\u03c7\u03c9\u03c1\u03ae\u03c3\u03b5\u03b9. \u0397 \u03b4\u03b9\u03b1\u03c6\u03bf\u03c1\u03ac \u03c4\u03ce\u03c1\u03b1 \u03b5\u03af\u03bd\u03b1\u03b9 \u03cc\u03c4\u03b9 \u03b7 \u03ad\u03be\u03bf\u03b4\u03bf\u03c2 \u03b5\u03af\u03bd\u03b1\u03b9 \u03c0\u03bf\u03bb\u03cd \u03bc\u03b1\u03ba\u03c1\u03b9\u03ac. \u0391\u03bd\u03c4\u03af \u03bd\u03b1 \u03ba\u03b1\u03b8\u03bf\u03c1\u03af\u03c3\u03b5\u03b9\u03c2 \u03c4\u03b7\u03bd \u03b5\u03bd\u03c4\u03bf\u03bb\u03ae \u03bc\u03b5\u03c4\u03b1\u03ba\u03af\u03bd\u03b7\u03c3\u03b7\u03c2 6 \u03c6\u03bf\u03c1\u03ad\u03c2, \u03c7\u03c1\u03b7\u03c3\u03b9\u03bc\u03bf\u03c0\u03bf\u03af\u03b7\u03c3\u03b5 \u03c4\u03b7\u03bd \u03b5\u03bd\u03c4\u03bf\u03bb\u03ae 'repeat' \u03b3\u03b9\u03b1 \u03bd\u03b1 \u03b5\u03c0\u03b1\u03bd\u03b1\u03bb\u03ac\u03b2\u03b5\u03b9\u03c2 \u03c4\u03b7\u03bd \u03b5\u03bd\u03c4\u03bf\u03bb\u03ae 'move' 6 \u03c6\u03bf\u03c1\u03ad\u03c2.
DESC_05=<p>\u039f\u03c5\u03c6, \u03ac\u03bb\u03bb\u03bf \u03b4\u03c9\u03bc\u03ac\u03c4\u03b9\u03bf \u03c0\u03af\u03c3\u03c9 \u03bc\u03bf\u03c5, \u03b5\u03c5\u03c7\u03b1\u03c1\u03b9\u03c3\u03c4\u03ce!</p>\
        <p>\u03a0\u03b1\u03c1\u03b1\u03ba\u03b1\u03bb\u03ce \u03b2\u03bf\u03ae\u03b8\u03b7\u03c3\u03ad \u03bc\u03b5 \u03ba\u03b1\u03b9 \u03c3\u03b5 \u03b1\u03c5\u03c4\u03cc \u03c4\u03bf \u03b4\u03c9\u03bc\u03ac\u03c4\u03b9\u03bf!</p>
HINT_05=<p>\u03a3\u03b5 \u03b1\u03c5\u03c4\u03cc \u03c4\u03bf \u03b4\u03c9\u03bc\u03ac\u03c4\u03b9\u03bf, \u03b7 \u039a\u03ac\u03c1\u03bb\u03b1 \u03c0\u03c1\u03ad\u03c0\u03b5\u03b9 \u03bd\u03b1 \u03c0\u03ac\u03b5\u03b9 \u03b5\u03c5\u03b8\u03b5\u03af\u03b1 \u03b3\u03b9\u03b1 \u03bb\u03af\u03b3\u03bf, \u03bc\u03b5\u03c4\u03ac \u03bd\u03b1 \u03c3\u03c4\u03c1\u03af\u03c8\u03b5\u03b9 \u03b4\u03b5\u03be\u03b9\u03ac \u03ba\u03b1\u03b9 \u03bd\u03b1 \u03c0\u03ac\u03b5\u03b9 \u03b5\u03c5\u03b8\u03b5\u03af\u03b1 \u03b3\u03b9\u03b1 \u03bb\u03af\u03b3\u03bf \u03b1\u03ba\u03cc\u03bc\u03b1. \u03a7\u03c1\u03b7\u03c3\u03b9\u03bc\u03bf\u03c0\u03bf\u03af\u03b7\u03c3\u03b5 \u03c4\u03b7\u03bd \u03b5\u03bd\u03c4\u03bf\u03bb\u03ae 'turn-right' \u03c0\u03bf\u03c5 \u03cc\u03c1\u03b9\u03c3\u03b5\u03c2 \u03c0\u03c1\u03b9\u03bd \u03b3\u03b9\u03b1 \u03bd\u03b1 \u03c3\u03c4\u03c1\u03af\u03c8\u03b5\u03b9 \u03b4\u03b5\u03be\u03b9\u03ac.</p>
        <p>\u0398\u03b1 \u03c0\u03b1\u03c1\u03b1\u03c4\u03b7\u03c1\u03ae\u03c3\u03b5\u03b9\u03c2 \u03b5\u03c0\u03af\u03c3\u03b7\u03c2 \u03cc\u03c4\u03b9 \u03b7 Karla \u03ba\u03b1\u03b9 \u03c3\u03c4\u03b9\u03c2 \u03b4\u03cd\u03bf \u03c0\u03b5\u03c1\u03b9\u03c0\u03c4\u03ce\u03c3\u03b5\u03b9\u03c2 \u03c7\u03c1\u03b5\u03b9\u03ac\u03b6\u03b5\u03c4\u03b1\u03b9 \u03bd\u03b1 \u03ba\u03ac\u03bd\u03b5\u03b9 \u03b1\u03ba\u03c1\u03b9\u03b2\u03ce\u03c2 6 \u03b2\u03ae\u03bc\u03b1\u03c4\u03b1 - \u03ad\u03c7\u03bf\u03c5\u03bc\u03b5 \u03bc\u03b9\u03b1 \u03b5\u03bd\u03c4\u03bf\u03bb\u03ae \u03b3\u03b9\u03b1 \u03b1\u03c5\u03c4\u03cc, \u03b3\u03b9\u03b1\u03c4\u03af \u03bd\u03b1 \u03bc\u03b7\u03bd \u03c4\u03b7 \u03c7\u03c1\u03b7\u03c3\u03b9\u03bc\u03bf\u03c0\u03bf\u03b9\u03ae\u03c3\u03bf\u03c5\u03bc\u03b5;</p>
DESC_06=<p>\u0395\u03c5\u03c7\u03b1\u03c1\u03b9\u03c3\u03c4\u03ce \u03c0\u03bf\u03c5 \u03bc\u03b5 \u03ba\u03b1\u03b8\u03bf\u03b4\u03b7\u03b3\u03ae\u03c3\u03b5\u03c2!</p>
        <p>\u0388\u03c7\u03bf\u03c5\u03bc\u03b5 \u03ad\u03bd\u03b1 \u03ac\u03bb\u03bb\u03bf \u03c0\u03c1\u03cc\u03b2\u03bb\u03b7\u03bc\u03b1, \u03c6\u03bf\u03b2\u03ac\u03bc\u03b1\u03b9: \u03bf \u03c0\u03b1\u03c1\u03b5\u03bc\u03b2\u03bf\u03bb\u03ad\u03b1\u03c2 \u03b5\u03af\u03bd\u03b1\u03b9 \u03c0\u03b9\u03bf \u03ad\u03bd\u03c4\u03bf\u03bd\u03bf\u03c2 \u03c3\u03b5 \u03cc\u03bb\u03b1 \u03c4\u03b1 \u03b5\u03c0\u03cc\u03bc\u03b5\u03bd\u03b1 \u03b4\u03c9\u03bc\u03ac\u03c4\u03b9\u03b1. \u0398\u03b1 \u03bc\u03c0\u03bf\u03c1\u03bf\u03cd\u03c3\u03b5\u03c2 \u03bd\u03b1 \u03bc\u03bf\u03c5 \u03c0\u03b1\u03c1\u03ad\u03c7\u03b5\u03b9\u03c2 \u03bf\u03b4\u03b7\u03b3\u03af\u03b5\u03c2 \u03c0\u03bf\u03c5 \u03b8\u03b1 \u03bc\u03b5 \u03ba\u03b1\u03b8\u03bf\u03b4\u03b7\u03b3\u03ae\u03c3\u03bf\u03c5\u03bd \u03bc\u03ad\u03c3\u03b1 \u03b1\u03c0\u03cc \u03b1\u03c5\u03c4\u03ac;</p>
HINT_06=<p>\u0397 \u039a\u03ac\u03c1\u03bb\u03b1 \u03c0\u03c1\u03ad\u03c0\u03b5\u03b9 \u03bd\u03b1 \u03c0\u03ac\u03b5\u03b9 \u03b5\u03c5\u03b8\u03b5\u03af\u03b1 \u03b3\u03b9\u03b1 \u03bb\u03af\u03b3\u03bf, \u03bc\u03b5\u03c4\u03ac \u03bd\u03b1 \u03c3\u03c4\u03c1\u03af\u03c8\u03b5\u03b9 \u03b4\u03b5\u03be\u03b9\u03ac \u03ba\u03b1\u03b9 \u03bc\u03b5\u03c4\u03ac \u03bd\u03b1 \u03c0\u03ac\u03b5\u03b9 \u03b5\u03c5\u03b8\u03b5\u03af\u03b1 \u03b3\u03b9\u03b1 \u03bb\u03af\u03b3\u03bf \u03b1\u03ba\u03cc\u03bc\u03b1. \u03a3\u03b5 \u03b1\u03bd\u03c4\u03af\u03b8\u03b5\u03c3\u03b7 \u03bc\u03b5 \u03c4\u03b9\u03c2 \u03c0\u03c1\u03bf\u03b7\u03b3\u03bf\u03cd\u03bc\u03b5\u03bd\u03b5\u03c2 \u03c0\u03b5\u03c1\u03b9\u03c0\u03c4\u03ce\u03c3\u03b5\u03b9\u03c2, \u03c4\u03ce\u03c1\u03b1 \u03c5\u03c0\u03ac\u03c1\u03c7\u03bf\u03c5\u03bd \u03c0\u03bf\u03bb\u03bb\u03ac \u03b4\u03c9\u03bc\u03ac\u03c4\u03b9\u03b1 \u03ba\u03b1\u03b9 \u03bf\u03b9 \u03af\u03b4\u03b9\u03b5\u03c2 \u03bf\u03b4\u03b7\u03b3\u03af\u03b5\u03c2 \u03c0\u03c1\u03ad\u03c0\u03b5\u03b9 \u03bd\u03b1 \u03bb\u03b5\u03b9\u03c4\u03bf\u03c5\u03c1\u03b3\u03bf\u03cd\u03bd \u03b3\u03b9\u03b1 \u03cc\u03bb\u03b1 \u03b1\u03c5\u03c4\u03ac. \u03a3\u03b7\u03bc\u03b5\u03b9\u03ce\u03c3\u03c4\u03b5 \u03cc\u03c4\u03b9 \u03b7 Karla \u03b4\u03b5\u03bd \u03bc\u03c0\u03bf\u03c1\u03b5\u03af \u03bd\u03b1 \u03c0\u03b5\u03c1\u03ac\u03c3\u03b5\u03b9 \u03bc\u03ad\u03c3\u03b1 \u03b1\u03c0\u03cc \u03ad\u03bd\u03b1\u03bd \u03c4\u03bf\u03af\u03c7\u03bf - \u03b8\u03b1 \u03bc\u03c0\u03bf\u03c1\u03bf\u03cd\u03c3\u03b5 \u03bd\u03b1 \u03c4\u03c1\u03b1\u03c5\u03bc\u03b1\u03c4\u03b9\u03c3\u03c4\u03b5\u03af. \u03a7\u03c1\u03b7\u03c3\u03b9\u03bc\u03bf\u03c0\u03bf\u03af\u03b7\u03c3\u03b5 \u03c4\u03b7 \u03c3\u03c5\u03bd\u03b8\u03ae\u03ba\u03b7 'is wall' \u03b3\u03b9\u03b1 \u03bd\u03b1 \u03c0\u03b5\u03c1\u03c0\u03b1\u03c4\u03ae\u03c3\u03b5\u03b9 \u03bc\u03ad\u03c7\u03c1\u03b9\u03c2 \u03cc\u03c4\u03bf\u03c5 \u03c6\u03c4\u03ac\u03c3\u03b5\u03b9 \u03c3\u03c4\u03bf\u03bd \u03c4\u03bf\u03af\u03c7\u03bf, \u03ba\u03b1\u03b9 \u03bc\u03b5\u03c4\u03ac \u03bd\u03b1 \u03c3\u03c4\u03c1\u03af\u03c8\u03b5\u03b9. \u0394\u03b5\u03bd \u03c5\u03c0\u03ac\u03c1\u03c7\u03b5\u03b9 \u03b1\u03bd\u03ac\u03b3\u03ba\u03b7 \u03bd\u03b1 \u03c3\u03c4\u03b1\u03bc\u03b1\u03c4\u03ae\u03c3\u03b5\u03b9 \u03c3\u03c4\u03b7\u03bd \u03ad\u03be\u03bf\u03b4\u03bf, \u03b7 \u039a\u03ac\u03c1\u03bb\u03b1 \u03b8\u03b1 \u03c0\u03b5\u03c1\u03c0\u03b1\u03c4\u03ae\u03c3\u03b5\u03b9  \u03bc\u03cc\u03bd\u03b7 \u03c4\u03b7\u03c2 \u03c3' \u03b1\u03c5\u03c4\u03ae\u03bd.</p>
DESC_08=<p>Thanks for getting me through all those rooms! It seems there's \
        a series of curved hallways ahead of me. This will be tricky!</p>
HINT_08=<p>We will need to use more conditions, and a loop now. Create a \
        <code>while</code> loop with a condition "is exit". Inside it, we need to \
        to the commands that will help Karla get to the exit. Note the hallways are \
        very simple - when Karla's sees a wall while heading to right (east), \
        she always need to turn left, and when she's sees a wall while heading up \
        (north), she always needs to turn right. And she never heads in any other direction.\
        So, create a program that will go straight until Karla sees a wall, and \
        then turns left is she's heading to east, and to right otherwise.
DESC_09=<p>Uh, I squeezed through the narrow hallways, thanks! But seems more hallways \
         are ahead, and this time they are not so easy!</p>
HINT_09=<p>Note this time, the hallways now go in all directions. Karla will need \
        to go both left and right, and both up and down. There are even some wider \
        parts of the hallways!</p>\
        <p>The way to get out of this maze is to walk through it with right (or left) \
        hand on the wall.</p>\
        <p>Note Karla cannot check directly if a wall is next to her on the right size, \
        she can only check if there's a wall directly in front of her in the direction \
        she is heading. But she can turn right, and look if a wall is there.</p>\
        <p>Also note that at the beginning, Karla has a wall next to her on the right.<p>\
        <p>When Karla has a wall next to her on right, and there's nothing in front of her, \
        she can make a step. And then she needs to ensure her orientation is such that \
        there is a wall on her right size. Given she just made a step when she had a \
        wall on her right, it is enough to turn right, and the turn left as long as there's \
        a wall in front of her. Then she can start from the beginning, doing a step, and \
        re-orientating so that there's a wall on her right side, until she reaches exit.</p>
DESC_10=<p>That was difficult, thanks for guiding me through! This time it seems \
        I am in the middle of a room! But, I feel this may be the last set of rooms - \
        I may be nearly out!</p>
HINT_10=<p>This time, Karla is in the middle of an empty space, and there is a maze \
        to the exit. In the previous set of rooms, Karla learned to find the exit \
        when she start with a wall on her right side (and empty space in front of her). \
        Let's build on that - learn Karla to reach that state from an empty space.</p>\
        <p>This can be simply done by walking until Karla sees a wall, and then turning left \
        as long as Karla sees a wall. Then just call the command from the previous \
        set of rooms to guide her to the exit!</p>
DESC_99=<p>Hurray, I am out now. Thanks for freeing me up!</p>\
        <p>Feel free to give me some commands to walk around!.</p>
HINT_99=

COMMAND_turn-back=turn-back
COMMAND_turn-right=turn-right
COMMAND_two-steps=two-steps
COMMAND_six-steps=six-steps
COMMAND_walk-turn-walk=walk-turn-walk
COMMAND_check-walk-turn-walk=check-walk-turn-walk
COMMAND_freeform=freeform
