#
# Karel
# Copyright (C) 2014-2015 Jaroslav Tulach <jaroslav.tulach@apidesign.org>
#
# This program is free software: you can redistribute it and/or modify
# it under the terms of the GNU General Public License as published by
# the Free Software Foundation, version 2 of the License.
#
# This program is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
# GNU General Public License for more details.
#
# You should have received a copy of the GNU General Public License
# along with this program. Look for COPYING file in the top folder.
# If not, see http://opensource.org/licenses/GPL-2.0.
#


HARDCODED_StartText=\u0397 \u039a\u03ac\u03c1\u03bb\u03b1 \u03c4\u03bf \u03c1\u03bf\u03bc\u03c0\u03cc\u03c4 \u03ad\u03c7\u03b5\u03b9 \u03c7\u03b1\u03b8\u03b5\u03af \u03c3\u03b5 \u03ad\u03bd\u03b1 \u03c4\u03b5\u03c1\u03ac\u03c3\u03c4\u03b9\u03bf \u03ba\u03c4\u03af\u03c1\u03b9\u03bf \u03ba\u03b1\u03b9 \u03c7\u03c1\u03b5\u03b9\u03ac\u03b6\u03b5\u03c4\u03b1\u03b9 \u03b2\u03bf\u03ae\u03b8\u03b5\u03b9\u03b1 \u03b3\u03b9\u03b1 \u03bd\u03b1 \u03b2\u03b3\u03b5\u03b9 \u03ad\u03be\u03c9. \u0398\u03b1 \u03c4\u03b7 \u03b2\u03bf\u03b7\u03b8\u03ae\u03c3\u03b5\u03b9\u03c2;
HARDCODED_StartCommand=\u0395\u03af\u03bc\u03b1\u03b9 \u03c3\u03b5 \u03b1\u03c5\u03c4\u03cc!
HARDCODED_TryAgain=\u0395\u03c0\u03b1\u03bd\u03ac\u03bb\u03b7\u03c8\u03b7
HARDCODED_NextRoom=\u0395\u03c0\u03cc\u03bc\u03b5\u03bd\u03bf \u03b4\u03c9\u03bc\u03ac\u03c4\u03b9\u03bf &raquo;
HARDCODED_Go=\u039e\u03b5\u03ba\u03af\u03bd\u03b1!
HARDCODED_GoHint=(\u0395\u03ba\u03c4\u03ad\u03bb\u03b5\u03c3\u03b5 \u03c4\u03b7\u03bd \u03b5\u03bd\u03c4\u03bf\u03bb\u03ae {0})
HARDCODED_Stop=\u03a3\u03c4\u03bf\u03c0
HARDCODED_GiveUp=\u0395\u03b3\u03ba\u03b1\u03c4\u03b1\u03bb\u03b5\u03af\u03c0\u03c9, \u03b4\u03b5\u03af\u03be\u03b5 \u03bc\u03bf\u03c5 \u03c4\u03b7 \u03bb\u03cd\u03c3\u03b7!
HARDCODED_DidntReachExit=\u0395\u03b5, \u03b4\u03b5\u03bd \u03ad\u03c6\u03b8\u03b1\u03c3\u03b1 \u03c3\u03c4\u03b7\u03bd \u03ad\u03be\u03bf\u03b4\u03bf. \u039e\u03b1\u03bd\u03b1\u03c0\u03c1\u03bf\u03c3\u03c0\u03ac\u03b8\u03b7\u03c3\u03b5!
HARDCODED_HINT=\u03a3\u03a5\u039c\u0392\u039f\u03a5\u039b\u0397:

Error_Wall=<strong>\u0391\u03b1\u03b1!</strong> \u0388\u03c0\u03b5\u03c3\u03b1 \u03c3\u03c4\u03bf\u03bd \u03c4\u03bf\u03af\u03c7\u03bf!
Error_NoMarks=<strong>\u039b\u03ac\u03b8\u03bf\u03c2!</strong> \u0394\u03b5\u03bd \u03c5\u03c0\u03ac\u03c1\u03c7\u03b5\u03b9 \u03c3\u03b7\u03bc\u03ac\u03b4\u03b9!
Error_TooManyMarks=<strong>\u039b\u03ac\u03b8\u03bf\u03c2!</strong> \u03a0\u03ac\u03c1\u03b1 \u03c0\u03bf\u03bb\u03bb\u03ac \u03c3\u03b7\u03bc\u03ac\u03b4\u03b9\u03b1!
Error_UnknowCommand=<strong>\u039b\u03ac\u03b8\u03bf\u03c2!</strong> \u039b\u03ac\u03b8\u03bf\u03c2 \u03b5\u03bd\u03c4\u03bf\u03bb\u03ae {0}!
Error_unknown=<strong>\u039b\u03ac\u03b8\u03bf\u03c2!</strong> \u0386\u03b3\u03bd\u03c9\u03c3\u03c4\u03bf \u03bb\u03ac\u03b8\u03bf\u03c2!

DESC_00=<p>\u03a7\u03c1\u03b5\u03b9\u03ac\u03b6\u03bf\u03bc\u03b1\u03b9 \u03c4\u03b7 \u03b2\u03bf\u03ae\u03b8\u03b5\u03b9\u03ac \u03c3\u03bf\u03c5!</p>\
        <p>\u0395\u03af\u03bc\u03b1\u03b9 \u03c4\u03bf \u03c1\u03bf\u03bc\u03c0\u03cc\u03c4 \u039a\u03ac\u03c1\u03bb\u03b1 \u03ba\u03b1\u03b9 \u03c7\u03ac\u03b8\u03b7\u03ba\u03b1 \u03c3\u03b5 \u03b1\u03c5\u03c4\u03cc \u03c4\u03bf \u03ba\u03c4\u03af\u03c1\u03b9\u03bf. \u03a4\u03b1 \u03ba\u03c5\u03ba\u03bb\u03ce\u03bc\u03b1\u03c4\u03b1 \u03c0\u03bb\u03bf\u03ae\u03b3\u03b7\u03c3\u03ae\u03c2 \u03bc\u03bf\u03c5 \u03ad\u03c7\u03bf\u03c5\u03bd \u03c3\u03c0\u03ac\u03c3\u03b5\u03b9, \u03b5\u03c0\u03bf\u03bc\u03ad\u03bd\u03c9\u03c2 \u03b4\u03b5\u03bd \u03bc\u03c0\u03bf\u03c1\u03ce \u03bd\u03b1 \u03c0\u03bb\u03bf\u03b7\u03b3\u03b7\u03b8\u03ce \u03c3\u03c9\u03c3\u03c4\u03ac.</p>\
        <p>\u039c\u03c0\u03bf\u03c1\u03b5\u03af\u03c2 \u03bd\u03b1 \u03c7\u03c1\u03b7\u03c3\u03b9\u03bc\u03bf\u03c0\u03bf\u03b9\u03ae\u03c3\u03b5\u03c2 \u03c4\u03b9\u03c2 \u03b5\u03bd\u03c4\u03bf\u03bb\u03ad\u03c2 \u03ba\u03b1\u03b9 \u03bd\u03b1 \u03bc\u03b5 \u03ba\u03b1\u03b8\u03bf\u03b4\u03b7\u03b3\u03ae\u03c3\u03b5\u03b9\u03c2 \u03c3\u03c4\u03b7\u03bd \u03ad\u03be\u03bf\u03b4\u03bf;</p>
HINT_00=\u03a7\u03c1\u03b7\u03c3\u03b9\u03bc\u03bf\u03c0\u03bf\u03af\u03b7\u03c3\u03b5 \u03c4\u03b9\u03c2 \u03b5\u03bd\u03c4\u03bf\u03bb\u03ad\u03c2 '\u03c3\u03c4\u03c1\u03af\u03c8\u03b5-\u03b1\u03c1\u03b9\u03c3\u03c4\u03b5\u03c1\u03ac' \u03ba\u03b1\u03b9 '\u03b2\u03ae\u03bc\u03b1' \u03b3\u03b9\u03b1 \u03bd\u03b1 \u03bc\u03b5\u03c4\u03b1\u03ba\u03b9\u03bd\u03ae\u03c3\u03b5\u03b9\u03c2 \u03c4\u03b7\u03bd \u039a\u03ac\u03c1\u03bb\u03b1 \u03c3\u03c4\u03b7\u03bd \u03ad\u03be\u03bf\u03b4\u03bf. \u03a3\u03b7\u03bc\u03b5\u03af\u03c9\u03c3\u03b5 \u03cc\u03c4\u03b9 \u03b7 \u039a\u03ac\u03c1\u03bb\u03b1 \u03b4\u03b5\u03bd \u03bc\u03c0\u03bf\u03c1\u03b5\u03af \u03bd\u03b1 \u03c0\u03b5\u03c1\u03ac\u03c3\u03b5\u03b9 \u03bc\u03ad\u03c3\u03b1 \u03b1\u03c0\u03cc \u03c4\u03bf\u03c5\u03c2 \u03c4\u03bf\u03af\u03c7\u03bf\u03c5\u03c2!
DESC_01=<p>\u039f\u03c5\u03c6, \u03b5\u03c5\u03c7\u03b1\u03c1\u03b9\u03c3\u03c4\u03ce \u03c0\u03bf\u03c5 \u03bc\u03b5 \u03b2\u03bf\u03ae\u03b8\u03b7\u03c3\u03b5\u03c2 \u03bd\u03b1 \u03b2\u03b3\u03c9 \u03b1\u03c0\u03cc \u03c4\u03bf \u03b4\u03c9\u03bc\u03ac\u03c4\u03b9\u03bf.</p>\
        <p>\u0395\u03af\u03bc\u03b1\u03b9 \u03c3\u03b5 \u03ac\u03bb\u03bb\u03bf \u03b4\u03c9\u03bc\u03ac\u03c4\u03b9\u03bf \u03c4\u03ce\u03c1\u03b1. \u03a6\u03bf\u03b2\u03ac\u03bc\u03b1\u03b9 \u03cc\u03c4\u03b9 \u03b8\u03b1 \u03c7\u03c1\u03b5\u03b9\u03b1\u03c3\u03c4\u03ce \u03c4\u03b7 \u03b2\u03bf\u03ae\u03b8\u03b5\u03b9\u03ac \u03c3\u03bf\u03c5 \u03b3\u03b9\u03b1 \u03bd\u03b1 \u03b2\u03b3\u03c9 \u03cc\u03c7\u03b9 \u03bc\u03cc\u03bd\u03bf \u03b1\u03c0\u03cc \u03b1\u03c5\u03c4\u03cc \u03c4\u03bf \u03b4\u03c9\u03bc\u03ac\u03c4\u03b9\u03bf, \u03b1\u03bb\u03bb\u03ac \u03b3\u03b9\u03b1 \u03bd\u03b1 \u03c0\u03b5\u03c1\u03ac\u03c3\u03c9 \u03b1\u03c0\u03cc \u03bc\u03b9\u03b1 \u03c3\u03b5\u03b9\u03c1\u03ac \u03b1\u03c0\u03cc \u03b4\u03c9\u03bc\u03ac\u03c4\u03b9\u03b1, \u03b3\u03b9\u03b1 \u03bd\u03b1 \u03b2\u03b3\u03c9 \u03b1\u03c0\u03cc \u03b1\u03c5\u03c4\u03cc \u03c4\u03bf \u03ba\u03c4\u03af\u03c1\u03b9\u03bf.</p>\
        <p>\u0395\u03c0\u03af\u03c3\u03b7\u03c2, \u03c5\u03c0\u03ac\u03c1\u03c7\u03bf\u03c5\u03bd \u03c0\u03bf\u03bb\u03bb\u03ad\u03c2 \u03c0\u03b1\u03c1\u03b5\u03bc\u03b2\u03bf\u03bb\u03ad\u03c2 \u03b5\u03b4\u03ce, \u03c6\u03bf\u03b2\u03ac\u03bc\u03b1\u03b9 \u03cc\u03c4\u03b9 \u03b4\u03b5\u03bd \u03bc\u03c0\u03bf\u03c1\u03b5\u03af\u03c2 \u03c0\u03bb\u03ad\u03bf\u03bd \u03bd\u03b1 \u03bc\u03bf\u03c5 \u03b4\u03ce\u03c3\u03b5\u03b9\u03c2 \u03b5\u03bd\u03c4\u03bf\u03bb\u03ad\u03c2 \u03bc\u03af\u03b1 \u03c0\u03c1\u03bf\u03c2 \u03bc\u03af\u03b1. \u0398\u03b1 \u03c7\u03c1\u03b5\u03b9\u03b1\u03c3\u03c4\u03b5\u03af \u03bd\u03b1 \u03bc\u03bf\u03c5 \u03b4\u03ce\u03c3\u03b5\u03b9\u03c2 \u03bc\u03b9\u03b1 \u03bb\u03af\u03c3\u03c4\u03b1 \u03b5\u03bd\u03c4\u03bf\u03bb\u03ce\u03bd \u03c0\u03bf\u03c5 \u03bd\u03b1 \u03bc\u03c0\u03bf\u03c1\u03ce \u03bd\u03b1 \u03b1\u03ba\u03bf\u03bb\u03bf\u03c5\u03b8\u03ae\u03c3\u03c9.</p>\
        <p>\u0395\u03c5\u03c4\u03c5\u03c7\u03ce\u03c2, \u03ad\u03bd\u03b1 \u03bc\u03ad\u03c1\u03bf\u03c2 \u03c4\u03b7\u03c2 \u03cc\u03c1\u03b1\u03c3\u03ae\u03c2 \u03bc\u03bf\u03c5 \u03b4\u03b9\u03b1\u03c4\u03b7\u03c1\u03b5\u03af\u03c4\u03b1\u03b9 \u03b1\u03ba\u03cc\u03bc\u03b1, \u03c0\u03b1\u03c1\u03ac \u03c4\u03b9\u03c2 \u03c0\u03b1\u03c1\u03b5\u03bc\u03b2\u03bf\u03bb\u03ad\u03c2, \u03bf\u03c0\u03cc\u03c4\u03b5 \u03b8\u03b1 \u03b5\u03af\u03bd\u03b1\u03b9 \u03b1\u03c1\u03ba\u03b5\u03c4\u03cc \u03b3\u03b9\u03b1 \u03bd\u03b1 \u03b2\u03b5\u03b2\u03b1\u03b9\u03c9\u03b8\u03ce \u03cc\u03c4\u03b9 \u03c3\u03c4\u03ad\u03ba\u03bf\u03bc\u03b1\u03b9 \u03b4\u03af\u03c0\u03bb\u03b1 \u03c3\u03c4\u03b7\u03bd \u03ad\u03be\u03bf\u03b4\u03bf \u03ba\u03b1\u03b9 \u03c4\u03b7\u03bd \u03b1\u03bd\u03c4\u03b9\u03ba\u03c1\u03af\u03b6\u03c9.</p>
HINT_01=\u03a3\u03b7\u03bc\u03b5\u03af\u03c9\u03c3\u03b5 \u03cc\u03c4\u03b9 \u03b7 \u03ad\u03be\u03bf\u03b4\u03bf\u03c2 \u03b5\u03af\u03bd\u03b1\u03b9 \u03c0\u03af\u03c3\u03c9 \u03b1\u03c0\u03cc \u03c4\u03b7\u03bd \u039a\u03ac\u03c1\u03bb\u03b1. \u0393\u03cd\u03c1\u03b9\u03c3\u03ad \u03c4\u03b7\u03bd \u03ad\u03c4\u03c3\u03b9 \u03ce\u03c3\u03c4\u03b5 \u03bd\u03b1 \u03ba\u03bf\u03b9\u03c4\u03ac\u03b6\u03b5\u03b9 \u03c0\u03c1\u03bf\u03c2 \u03c4\u03b1 \u03c0\u03af\u03c3\u03c9. \u039a\u03ac\u03bd\u03b5 \u03c4\u03b7 \u03bd\u03b1 \u03c3\u03c4\u03c1\u03af\u03c8\u03b5\u03b9 \u03b1\u03c1\u03b9\u03c3\u03c4\u03b5\u03c1\u03ac. \u03a3\u03c5\u03bc\u03c0\u03bb\u03ae\u03c1\u03c9\u03c3\u03b5 \u03c4\u03b9\u03c2 \u03b5\u03bd\u03c4\u03bf\u03bb\u03ad\u03c2 \u03c3\u03c4\u03b7\u03bd \u03c0\u03c1\u03bf-\u03b4\u03b7\u03bc\u03b9\u03bf\u03c5\u03c1\u03b3\u03b7\u03bc\u03ad\u03bd\u03b7 \u03b5\u03bd\u03c4\u03bf\u03bb\u03ae '\u03b3\u03cd\u03c1\u03bd\u03b1-\u03c0\u03af\u03c3\u03c9' \u03ba\u03b1\u03b9 \u03c0\u03ac\u03c4\u03b7\u03c3\u03b5 '\u039e\u03b5\u03ba\u03af\u03bd\u03b1'!
DESC_02=\u039f\u03c5\u03c6, \u03b5\u03c5\u03c7\u03b1\u03c1\u03b9\u03c3\u03c4\u03ce! \u0388\u03bd\u03b1 \u03ac\u03bb\u03bb\u03bf \u03b4\u03c9\u03bc\u03ac\u03c4\u03b9\u03bf, \u03b7 \u03af\u03b4\u03b9\u03b1 \u03b5\u03c1\u03b3\u03b1\u03c3\u03af\u03b1 \u03bc\u03b5 \u03c4\u03b7\u03bd \u03c0\u03c1\u03bf\u03b7\u03b3\u03bf\u03cd\u03bc\u03b5\u03bd\u03b7 \u03c6\u03bf\u03c1\u03ac - \u03bc\u03c0\u03bf\u03c1\u03b5\u03af\u03c2 \u03c3\u03b5 \u03c0\u03b1\u03c1\u03b1\u03ba\u03b1\u03bb\u03ce \u03bd\u03b1 \u03bc\u03b5 \u03b3\u03c5\u03c1\u03af\u03c3\u03b5\u03b9\u03c2 \u03ce\u03c3\u03c4\u03b5 \u03bd\u03b1 \u03ba\u03bf\u03b9\u03c4\u03ac\u03be\u03c9 \u03c0\u03c1\u03bf\u03c2 \u03c4\u03b7\u03bd \u03ad\u03be\u03bf\u03b4\u03bf;
HINT_02=\u03a3\u03b7\u03bc\u03b5\u03af\u03c9\u03c3\u03b5 \u03cc\u03c4\u03b9 \u03b7 \u03ad\u03be\u03bf\u03b4\u03bf\u03c2 \u03b5\u03af\u03bd\u03b1\u03b9 \u03c3\u03c4\u03b1 \u03b4\u03b5\u03be\u03b9\u03ac \u03c4\u03b7\u03c2 \u039a\u03ac\u03c1\u03bb\u03b1\u03c2. \u038c\u03bc\u03c9\u03c2, \u03b7 \u039a\u03ac\u03c1\u03bb\u03b1 \u03b4\u03b5\u03bd \u03ad\u03c7\u03b5\u03b9 \u03b5\u03bd\u03c4\u03bf\u03bb\u03ae \u03bd\u03b1 \u03c3\u03c4\u03c1\u03af\u03c8\u03b5\u03b9 \u03b4\u03b5\u03be\u03b9\u03ac, \u03bc\u03cc\u03bd\u03bf \u03bd\u03b1 \u03c3\u03c4\u03c1\u03af\u03c8\u03b5\u03b9 \u03b1\u03c1\u03b9\u03c3\u03c4\u03b5\u03c1\u03ac. \u03a4\u03bf \u03bd\u03b1 \u03c3\u03c4\u03c1\u03af\u03c8\u03b5\u03b9 \u03b4\u03b5\u03be\u03b9\u03ac \u03b5\u03af\u03bd\u03b1\u03b9 \u03c4\u03bf \u03af\u03b4\u03b9\u03bf \u03bc\u03b5 \u03c4\u03bf \u03bd\u03b1 \u03c3\u03c4\u03c1\u03af\u03c8\u03b5\u03b9 \u03b1\u03c1\u03b9\u03c3\u03c4\u03b5\u03c1\u03ac \u03c4\u03c1\u03b5\u03b9\u03c2 \u03c6\u03bf\u03c1\u03ad\u03c2. \u038c\u03c1\u03b9\u03c3\u03b5 \u03c4\u03b7\u03bd \u03b5\u03bd\u03c4\u03bf\u03bb\u03ae \u03ad\u03c4\u03c3\u03b9 \u03ce\u03c3\u03c4\u03b5 \u03bd\u03b1 \u03c3\u03c4\u03c1\u03af\u03c8\u03b5\u03b9\u03c2 \u03c4\u03b7\u03bd \u039a\u03ac\u03c1\u03bb\u03b1 \u03b1\u03c1\u03b9\u03c3\u03c4\u03b5\u03c1\u03ac \u03c4\u03c1\u03b5\u03b9\u03c2 \u03c6\u03bf\u03c1\u03ad\u03c2. \u0389, \u03b1\u03ba\u03cc\u03bc\u03b1 \u03ba\u03b1\u03bb\u03cd\u03c4\u03b5\u03c1\u03b1, \u03cc\u03c1\u03b9\u03c3\u03b5 \u03c4\u03b7\u03bd \u03b5\u03bd\u03c4\u03bf\u03bb\u03ae \u03c7\u03c1\u03b7\u03c3\u03b9\u03bc\u03bf\u03c0\u03bf\u03b9\u03ce\u03bd\u03c4\u03b1\u03c2 \u03be\u03b1\u03bd\u03ac \u03c4\u03b7\u03bd \u03b5\u03bd\u03c4\u03bf\u03bb\u03ae '\u03b3\u03cd\u03c1\u03bd\u03b1-\u03c0\u03af\u03c3\u03c9' \u03b1\u03c0\u03cc \u03c4\u03bf \u03c0\u03c1\u03bf\u03b7\u03b3\u03bf\u03cd\u03bc\u03b5\u03bd\u03bf \u03b4\u03c9\u03bc\u03ac\u03c4\u03b9\u03bf: \u03b7 \u03c3\u03c4\u03c1\u03bf\u03c6\u03ae \u03b4\u03b5\u03be\u03b9\u03ac \u03b5\u03af\u03bd\u03b1\u03b9 \u03b7 \u03af\u03b4\u03b9\u03bf \u03bc\u03b5 \u03c4\u03bf \u03bd\u03b1 \u03b3\u03c5\u03c1\u03af\u03c3\u03b5\u03b9 \u03c0\u03af\u03c3\u03c9 \u03ba\u03b1\u03b9 \u03bc\u03b5\u03c4\u03ac \u03bd\u03b1 \u03c3\u03c4\u03c1\u03af\u03c8\u03b5\u03b9 \u03b1\u03c1\u03b9\u03c3\u03c4\u03b5\u03c1\u03ac.
DESC_03=<p>\u03a9\u03c7, \u03ac\u03bb\u03bb\u03bf \u03ad\u03bd\u03b1 \u03b4\u03c9\u03bc\u03ac\u03c4\u03b9\u03bf! \u0395\u03c5\u03c7\u03b1\u03c1\u03b9\u03c3\u03c4\u03ce \u03b3\u03b9\u03b1 \u03c4\u03b7 \u03b2\u03bf\u03ae\u03b8\u03b5\u03b9\u03ac \u03c3\u03bf\u03c5 \u03bc\u03ad\u03c7\u03c1\u03b9 \u03c4\u03ce\u03c1\u03b1!</p>\
         <p>\u03a6\u03bf\u03b2\u03ac\u03bc\u03b1\u03b9 \u03cc\u03c4\u03b9 \u03bf\u03b9 \u03c0\u03b1\u03c1\u03b5\u03bc\u03b2\u03bf\u03bb\u03ad\u03c2 \u03b3\u03af\u03bd\u03bf\u03bd\u03c4\u03b1\u03b9 \u03c7\u03b5\u03b9\u03c1\u03cc\u03c4\u03b5\u03c1\u03b5\u03c2. \u0397 \u03cc\u03c1\u03b1\u03c3\u03ae \u03bc\u03bf\u03c5 \u03b5\u03af\u03bd\u03b1\u03b9 \u03c0\u03bf\u03bb\u03cd \u03b5\u03be\u03b1\u03c3\u03b8\u03b5\u03bd\u03b7\u03bc\u03ad\u03bd\u03b7 \u03c4\u03ce\u03c1\u03b1. \u0395\u03af\u03bc\u03b1\u03b9 \u03c3\u03af\u03b3\u03bf\u03c5\u03c1\u03b7 \u03cc\u03c4\u03b9 \u03b8\u03b1 \u03b2\u03b5\u03bb\u03c4\u03b9\u03c9\u03b8\u03b5\u03af \u03cc\u03c4\u03b1\u03bd \u03b2\u03b3\u03c9 \u03b1\u03c0\u03cc \u03b1\u03c5\u03c4\u03cc \u03c4\u03bf \u03ba\u03c4\u03af\u03c1\u03b9\u03bf. \u0391\u03bb\u03bb\u03ac, \u03c0\u03c1\u03bf\u03c2 \u03c4\u03bf \u03c0\u03b1\u03c1\u03cc\u03bd, \u03c6\u03bf\u03b2\u03ac\u03bc\u03b1\u03b9 \u03cc\u03c4\u03b9 \u03b8\u03b1 \u03c7\u03c1\u03b5\u03b9\u03b1\u03c3\u03c4\u03ce \u03bd\u03b1 \u03bc\u03bf\u03c5 \u03b4\u03ce\u03c3\u03b5\u03b9\u03c2 \u03bf\u03b4\u03b7\u03b3\u03af\u03b5\u03c2 \u03b3\u03b9\u03b1 \u03bd\u03b1 \u03c6\u03c4\u03ac\u03c3\u03c9 \u03c3\u03c4\u03b7\u03bd \u03ad\u03be\u03bf\u03b4\u03bf, \u03cc\u03c7\u03b9 \u03bc\u03cc\u03bd\u03bf \u03bd\u03b1 \u03c3\u03c4\u03b1\u03b8\u03ce \u03b4\u03af\u03c0\u03bb\u03b1 \u03c4\u03b7\u03c2.</p>
HINT_03=\u0397 \u03ad\u03be\u03bf\u03b4\u03bf\u03c2 \u03b5\u03af\u03bd\u03b1\u03b9 \u03b4\u03cd\u03bf \u03c3\u03b5\u03b9\u03c1\u03ad\u03c2 \u03bc\u03c0\u03c1\u03bf\u03c3\u03c4\u03ac \u03b1\u03c0\u03cc \u03c4\u03b7\u03bd \u039a\u03ac\u03c1\u03bb\u03b1. \u0391\u03c0\u03bb\u03ce\u03c2 \u03cc\u03c1\u03b9\u03c3\u03b5 \u03c4\u03b7\u03bd \u03b5\u03bd\u03c4\u03bf\u03bb\u03ae \u03ad\u03c4\u03c3\u03b9 \u03ce\u03c3\u03c4\u03b5 \u03b7 \u039a\u03ac\u03c1\u03bb\u03b1 \u03bd\u03b1 \u03ba\u03b9\u03bd\u03b5\u03af\u03c4\u03b1\u03b9 \u03b4\u03cd\u03bf \u03c6\u03bf\u03c1\u03ad\u03c2.
DESC_04=\u0395\u03c5\u03c7\u03b1\u03c1\u03b9\u03c3\u03c4\u03ce \u03c0\u03bf\u03c5 \u03bc\u03b5 \u03ba\u03b1\u03b8\u03bf\u03b4\u03ae\u03b3\u03b7\u03c3\u03b5\u03c2 \u03c3\u03b5 \u03b1\u03c5\u03c4\u03cc \u03c4\u03bf \u03b4\u03c9\u03bc\u03ac\u03c4\u03b9\u03bf! \u039c\u03c0\u03bf\u03c1\u03b5\u03af\u03c2 \u03bd\u03b1 \u03bc\u03b5 \u03ba\u03b1\u03b8\u03bf\u03b4\u03b7\u03b3\u03ae\u03c3\u03b5\u03b9\u03c2 \u03ba\u03b1\u03b9 \u03c3\u03b5 \u03b1\u03c5\u03c4\u03cc \u03c4\u03bf \u03b4\u03c9\u03bc\u03ac\u03c4\u03b9\u03bf;
HINT_04=\u0391\u03c5\u03c4\u03cc \u03b5\u03af\u03bd\u03b1\u03b9 \u03c0\u03b1\u03c1\u03cc\u03bc\u03bf\u03b9\u03bf \u03bc\u03b5 \u03c4\u03bf \u03c0\u03c1\u03bf\u03b7\u03b3\u03bf\u03cd\u03bc\u03b5\u03bd\u03bf \u03b4\u03c9\u03bc\u03ac\u03c4\u03b9\u03bf - \u03b7 \u039a\u03ac\u03c1\u03bb\u03b1 \u03c0\u03c1\u03ad\u03c0\u03b5\u03b9 \u03b1\u03c0\u03bb\u03ce\u03c2 \u03bd\u03b1 \u03c0\u03c1\u03bf\u03c7\u03c9\u03c1\u03ae\u03c3\u03b5\u03b9. \u0397 \u03b4\u03b9\u03b1\u03c6\u03bf\u03c1\u03ac \u03c4\u03ce\u03c1\u03b1 \u03b5\u03af\u03bd\u03b1\u03b9 \u03cc\u03c4\u03b9 \u03b7 \u03ad\u03be\u03bf\u03b4\u03bf\u03c2 \u03b5\u03af\u03bd\u03b1\u03b9 \u03c0\u03bf\u03bb\u03cd \u03bc\u03b1\u03ba\u03c1\u03b9\u03ac. \u0391\u03bd\u03c4\u03af \u03bd\u03b1 \u03bf\u03c1\u03af\u03c3\u03b5\u03b9\u03c2 \u03c4\u03b7\u03bd \u03b5\u03bd\u03c4\u03bf\u03bb\u03ae \u03bc\u03b5\u03c4\u03b1\u03ba\u03af\u03bd\u03b7\u03c3\u03b7\u03c2 6 \u03c6\u03bf\u03c1\u03ad\u03c2, \u03c7\u03c1\u03b7\u03c3\u03b9\u03bc\u03bf\u03c0\u03bf\u03af\u03b7\u03c3\u03b5 \u03c4\u03b7\u03bd \u03b5\u03bd\u03c4\u03bf\u03bb\u03ae '\u03b5\u03c0\u03b1\u03bd\u03ac\u03bb\u03b7\u03c8\u03b7' \u03b3\u03b9\u03b1 \u03bd\u03b1 \u03b5\u03c0\u03b1\u03bd\u03b1\u03bb\u03ac\u03b2\u03b5\u03b9\u03c2 \u03c4\u03b7\u03bd \u03b5\u03bd\u03c4\u03bf\u03bb\u03ae '\u03b2\u03ae\u03bc\u03b1' 6 \u03c6\u03bf\u03c1\u03ad\u03c2.
DESC_05=<p>\u039f\u03c5\u03c6, \u03ac\u03bb\u03bb\u03bf \u03b4\u03c9\u03bc\u03ac\u03c4\u03b9\u03bf \u03b5\u03af\u03bd\u03b1\u03b9 \u03c0\u03bb\u03ad\u03bf\u03bd \u03c0\u03af\u03c3\u03c9 \u03bc\u03bf\u03c5, \u03b5\u03c5\u03c7\u03b1\u03c1\u03b9\u03c3\u03c4\u03ce!</p>\
        <p>\u03a0\u03b1\u03c1\u03b1\u03ba\u03b1\u03bb\u03ce \u03b2\u03bf\u03ae\u03b8\u03b7\u03c3\u03ad \u03bc\u03b5 \u03ba\u03b1\u03b9 \u03c3\u03b5 \u03b1\u03c5\u03c4\u03cc \u03c4\u03bf \u03b4\u03c9\u03bc\u03ac\u03c4\u03b9\u03bf!</p>
HINT_05=<p>\u03a3\u03b5 \u03b1\u03c5\u03c4\u03cc \u03c4\u03bf \u03b4\u03c9\u03bc\u03ac\u03c4\u03b9\u03bf, \u03b7 \u039a\u03ac\u03c1\u03bb\u03b1 \u03c0\u03c1\u03ad\u03c0\u03b5\u03b9 \u03bd\u03b1 \u03c0\u03ac\u03b5\u03b9 \u03b5\u03c5\u03b8\u03b5\u03af\u03b1 \u03b3\u03b9\u03b1 \u03bb\u03af\u03b3\u03bf, \u03bc\u03b5\u03c4\u03ac \u03bd\u03b1 \u03c3\u03c4\u03c1\u03af\u03c8\u03b5\u03b9 \u03b4\u03b5\u03be\u03b9\u03ac \u03ba\u03b1\u03b9 \u03bd\u03b1 \u03c0\u03ac\u03b5\u03b9 \u03b5\u03c5\u03b8\u03b5\u03af\u03b1 \u03b3\u03b9\u03b1 \u03bb\u03af\u03b3\u03bf \u03b1\u03ba\u03cc\u03bc\u03b1. \u03a7\u03c1\u03b7\u03c3\u03b9\u03bc\u03bf\u03c0\u03bf\u03af\u03b7\u03c3\u03b5 \u03c4\u03b7\u03bd \u03b5\u03bd\u03c4\u03bf\u03bb\u03ae '\u03c3\u03c4\u03c1\u03af\u03c8\u03b5-\u03b4\u03b5\u03be\u03b9\u03ac' \u03c0\u03bf\u03c5 \u03cc\u03c1\u03b9\u03c3\u03b5\u03c2 \u03c0\u03c1\u03b9\u03bd \u03b3\u03b9\u03b1 \u03bd\u03b1 \u03c3\u03c4\u03c1\u03af\u03c8\u03b5\u03b9 \u03b4\u03b5\u03be\u03b9\u03ac.</p>
        <p>\u0398\u03b1 \u03c0\u03b1\u03c1\u03b1\u03c4\u03b7\u03c1\u03ae\u03c3\u03b5\u03b9\u03c2 \u03b5\u03c0\u03af\u03c3\u03b7\u03c2 \u03cc\u03c4\u03b9 \u03b7 \u039a\u03ac\u03c1\u03bb\u03b1 \u03ba\u03b1\u03b9 \u03c3\u03c4\u03b9\u03c2 \u03b4\u03cd\u03bf \u03c0\u03b5\u03c1\u03b9\u03c0\u03c4\u03ce\u03c3\u03b5\u03b9\u03c2 \u03c7\u03c1\u03b5\u03b9\u03ac\u03b6\u03b5\u03c4\u03b1\u03b9 \u03bd\u03b1 \u03ba\u03ac\u03bd\u03b5\u03b9 \u03b1\u03ba\u03c1\u03b9\u03b2\u03ce\u03c2 6 \u03b2\u03ae\u03bc\u03b1\u03c4\u03b1 - \u03ad\u03c7\u03bf\u03c5\u03bc\u03b5 \u03bc\u03b9\u03b1 \u03b5\u03bd\u03c4\u03bf\u03bb\u03ae \u03b3\u03b9\u03b1 \u03b1\u03c5\u03c4\u03cc, \u03b3\u03b9\u03b1\u03c4\u03af \u03bd\u03b1 \u03bc\u03b7\u03bd \u03c4\u03b7 \u03c7\u03c1\u03b7\u03c3\u03b9\u03bc\u03bf\u03c0\u03bf\u03b9\u03ae\u03c3\u03b5\u03b9\u03c2;</p>
DESC_06=<p>\u0395\u03c5\u03c7\u03b1\u03c1\u03b9\u03c3\u03c4\u03ce \u03c0\u03bf\u03c5 \u03bc\u03b5 \u03ba\u03b1\u03b8\u03bf\u03b4\u03ae\u03b3\u03b7\u03c3\u03b5\u03c2!</p>
        <p>\u03a6\u03bf\u03b2\u03ac\u03bc\u03b1\u03b9 \u03cc\u03c4\u03b9 \u03ad\u03c7\u03bf\u03c5\u03bc\u03b5 \u03ac\u03bb\u03bb\u03bf \u03ad\u03bd\u03b1 \u03c0\u03c1\u03cc\u03b2\u03bb\u03b7\u03bc\u03b1: \u03bf \u03c0\u03b1\u03c1\u03b5\u03bc\u03b2\u03bf\u03bb\u03ad\u03b1\u03c2 \u03b5\u03af\u03bd\u03b1\u03b9 \u03c0\u03b9\u03bf \u03ad\u03bd\u03c4\u03bf\u03bd\u03bf\u03c2 \u03c3\u03b5 \u03cc\u03bb\u03b1 \u03c4\u03b1 \u03b5\u03c0\u03cc\u03bc\u03b5\u03bd\u03b1 \u03b4\u03c9\u03bc\u03ac\u03c4\u03b9\u03b1. \u0398\u03b1 \u03bc\u03c0\u03bf\u03c1\u03bf\u03cd\u03c3\u03b5\u03c2 \u03bd\u03b1 \u03bc\u03bf\u03c5 \u03c0\u03b1\u03c1\u03ad\u03c7\u03b5\u03b9\u03c2 \u03bf\u03b4\u03b7\u03b3\u03af\u03b5\u03c2 \u03c0\u03bf\u03c5 \u03b8\u03b1 \u03bc\u03b5 \u03ba\u03b1\u03b8\u03bf\u03b4\u03b7\u03b3\u03ae\u03c3\u03bf\u03c5\u03bd \u03bc\u03ad\u03c3\u03b1 \u03b1\u03c0\u03cc \u03b1\u03c5\u03c4\u03ac;</p>
HINT_06=<p>\u0397 \u039a\u03ac\u03c1\u03bb\u03b1 \u03c0\u03c1\u03ad\u03c0\u03b5\u03b9 \u03bd\u03b1 \u03c0\u03ac\u03b5\u03b9 \u03b5\u03c5\u03b8\u03b5\u03af\u03b1 \u03b3\u03b9\u03b1 \u03bb\u03af\u03b3\u03bf, \u03bc\u03b5\u03c4\u03ac \u03bd\u03b1 \u03c3\u03c4\u03c1\u03af\u03c8\u03b5\u03b9 \u03b4\u03b5\u03be\u03b9\u03ac \u03ba\u03b1\u03b9 \u03bc\u03b5\u03c4\u03ac \u03bd\u03b1 \u03c0\u03ac\u03b5\u03b9 \u03b5\u03c5\u03b8\u03b5\u03af\u03b1 \u03b3\u03b9\u03b1 \u03bb\u03af\u03b3\u03bf \u03b1\u03ba\u03cc\u03bc\u03b1. \u03a3\u03b5 \u03b1\u03bd\u03c4\u03af\u03b8\u03b5\u03c3\u03b7 \u03bc\u03b5 \u03c4\u03b9\u03c2 \u03c0\u03c1\u03bf\u03b7\u03b3\u03bf\u03cd\u03bc\u03b5\u03bd\u03b5\u03c2 \u03c0\u03b5\u03c1\u03b9\u03c0\u03c4\u03ce\u03c3\u03b5\u03b9\u03c2, \u03c4\u03ce\u03c1\u03b1 \u03c5\u03c0\u03ac\u03c1\u03c7\u03bf\u03c5\u03bd \u03c0\u03bf\u03bb\u03bb\u03ac \u03b4\u03c9\u03bc\u03ac\u03c4\u03b9\u03b1 \u03ba\u03b1\u03b9 \u03bf\u03b9 \u03af\u03b4\u03b9\u03b5\u03c2 \u03bf\u03b4\u03b7\u03b3\u03af\u03b5\u03c2 \u03c0\u03c1\u03ad\u03c0\u03b5\u03b9 \u03bd\u03b1 \u03bb\u03b5\u03b9\u03c4\u03bf\u03c5\u03c1\u03b3\u03bf\u03cd\u03bd \u03b3\u03b9\u03b1 \u03cc\u03bb\u03b1 \u03b1\u03c5\u03c4\u03ac. \u03a3\u03b7\u03bc\u03b5\u03af\u03c9\u03c3\u03b5 \u03cc\u03c4\u03b9 \u03b7 \u039a\u03ac\u03c1\u03bb\u03b1 \u03b4\u03b5\u03bd \u03bc\u03c0\u03bf\u03c1\u03b5\u03af \u03bd\u03b1 \u03c0\u03b5\u03c1\u03ac\u03c3\u03b5\u03b9 \u03bc\u03ad\u03c3\u03b1 \u03b1\u03c0\u03cc \u03ad\u03bd\u03b1\u03bd \u03c4\u03bf\u03af\u03c7\u03bf - \u03b8\u03b1 \u03bc\u03c0\u03bf\u03c1\u03bf\u03cd\u03c3\u03b5 \u03bd\u03b1 \u03c4\u03c1\u03b1\u03c5\u03bc\u03b1\u03c4\u03b9\u03c3\u03c4\u03b5\u03af. \u03a7\u03c1\u03b7\u03c3\u03b9\u03bc\u03bf\u03c0\u03bf\u03af\u03b7\u03c3\u03b5 \u03c4\u03b7 \u03c3\u03c5\u03bd\u03b8\u03ae\u03ba\u03b7 '\u03b5\u03af\u03bd\u03b1\u03b9 \u03c4\u03bf\u03af\u03c7\u03bf\u03c2' \u03b3\u03b9\u03b1 \u03bd\u03b1 \u03c0\u03b5\u03c1\u03c0\u03b1\u03c4\u03ae\u03c3\u03b5\u03b9 \u03bc\u03ad\u03c7\u03c1\u03b9\u03c2 \u03cc\u03c4\u03bf\u03c5 \u03c6\u03c4\u03ac\u03c3\u03b5\u03b9 \u03c3\u03c4\u03bf\u03bd \u03c4\u03bf\u03af\u03c7\u03bf, \u03ba\u03b1\u03b9 \u03bc\u03b5\u03c4\u03ac \u03bd\u03b1 \u03c3\u03c4\u03c1\u03af\u03c8\u03b5\u03b9. \u0394\u03b5\u03bd \u03c5\u03c0\u03ac\u03c1\u03c7\u03b5\u03b9 \u03b1\u03bd\u03ac\u03b3\u03ba\u03b7 \u03bd\u03b1 \u03c3\u03c4\u03b1\u03bc\u03b1\u03c4\u03ae\u03c3\u03b5\u03b9 \u03c3\u03c4\u03b7\u03bd \u03ad\u03be\u03bf\u03b4\u03bf, \u03b7 \u039a\u03ac\u03c1\u03bb\u03b1 \u03b8\u03b1 \u03c0\u03b5\u03c1\u03c0\u03b1\u03c4\u03ae\u03c3\u03b5\u03b9  \u03bc\u03cc\u03bd\u03b7 \u03c4\u03b7\u03c2 \u03c3' \u03b1\u03c5\u03c4\u03ae\u03bd.</p>
DESC_08=<p>\u0395\u03c5\u03c7\u03b1\u03c1\u03b9\u03c3\u03c4\u03ce \u03c0\u03bf\u03c5 \u03bc\u03b5 \u03c0\u03ad\u03c1\u03b1\u03c3\u03b5\u03c2 \u03b1\u03c0\u03cc \u03cc\u03bb\u03b1 \u03b1\u03c5\u03c4\u03ac \u03c4\u03b1 \u03b4\u03c9\u03bc\u03ac\u03c4\u03b9\u03b1! \u03a6\u03b1\u03af\u03bd\u03b5\u03c4\u03b1\u03b9 \u03cc\u03c4\u03b9 \u03c5\u03c0\u03ac\u03c1\u03c7\u03b5\u03b9 \
 \u03bc\u03b9\u03b1 \u03c3\u03b5\u03b9\u03c1\u03ac \u03b1\u03c0\u03cc \u03ba\u03b1\u03bc\u03c0\u03c5\u03bb\u03c9\u03c4\u03bf\u03cd\u03c2 \u03b4\u03b9\u03b1\u03b4\u03c1\u03cc\u03bc\u03bf\u03c5\u03c2 \u03bc\u03c0\u03c1\u03bf\u03c3\u03c4\u03ac \u03bc\u03bf\u03c5. \u0391\u03c5\u03c4\u03cc \u03b8\u03b1 \u03b5\u03af\u03bd\u03b1\u03b9 \u03b4\u03cd\u03c3\u03ba\u03bf\u03bb\u03bf!</p>
HINT_08=<p>\u0398\u03b1 \u03c7\u03c1\u03b5\u03b9\u03b1\u03c3\u03c4\u03b5\u03af \u03bd\u03b1 \u03c7\u03c1\u03b7\u03c3\u03b9\u03bc\u03bf\u03c0\u03bf\u03b9\u03ae\u03c3\u03bf\u03c5\u03bc\u03b5 \u03c0\u03b5\u03c1\u03b9\u03c3\u03c3\u03cc\u03c4\u03b5\u03c1\u03b5\u03c2 \u03c3\u03c5\u03bd\u03b8\u03ae\u03ba\u03b5\u03c2 \u03ba\u03b1\u03b9 \u03ad\u03bd\u03b1\u03bd \u03b2\u03c1\u03cc\u03c7\u03bf \u03c4\u03ce\u03c1\u03b1. \
\u0394\u03b7\u03bc\u03b9\u03bf\u03cd\u03c1\u03b3\u03b7\u03c3\u03b5 \u03ad\u03bd\u03b1 \u03b2\u03c1\u03cc\u03c7\u03bf <code>\u03b5\u03c0\u03b1\u03bd\u03ad\u03bb\u03b1\u03b2\u03b5</code> \u03bc\u03b5 \u03bc\u03b9\u03b1 \u03c3\u03c5\u03bd\u03b8\u03ae\u03ba\u03b7 "\u03b5\u03af\u03bd\u03b1\u03b9 \u03ad\u03be\u03bf\u03b4\u03bf\u03c2". \
\u039c\u03ad\u03c3\u03b1 \u03c3\u03c4\u03bf \u03b2\u03c1\u03cc\u03b3\u03c7\u03bf \u03c7\u03c1\u03b5\u03b9\u03b1\u03b6\u03cc\u03bc\u03b1\u03c3\u03c4\u03b5 \u03c4\u03b9\u03c2 \u03b5\u03bd\u03c4\u03bf\u03bb\u03ad\u03c2 \u03c0\u03bf\u03c5 \u03b8\u03b1 \u03b2\u03bf\u03b7\u03b8\u03ae\u03c3\u03bf\u03c5\u03bd \u03c4\u03b7\u03bd \u039a\u03ac\u03c1\u03bb\u03b1 \u03bd\u03b1 \u03c6\u03c4\u03ac\u03c3\u03b5\u03b9 \u03c3\u03c4\u03b7\u03bd \u03ad\u03be\u03bf\u03b4\u03bf. \
\u03a3\u03b7\u03bc\u03b5\u03af\u03c9\u03c3\u03b5 \u03cc\u03c4\u03b9 \u03bf\u03b9 \u03b4\u03b9\u03ac\u03b4\u03c1\u03bf\u03bc\u03bf\u03b9 \u03b5\u03af\u03bd\u03b1\u03b9 \u03c0\u03bf\u03bb\u03cd \u03b1\u03c0\u03bb\u03bf\u03af - \u03cc\u03c4\u03b1\u03bd \u03b7 \u039a\u03ac\u03c1\u03bb\u03b1 \u03b2\u03bb\u03ad\u03c0\u03b5\u03b9 \u03ad\u03bd\u03b1\u03bd \u03c4\u03bf\u03af\u03c7\u03bf \u03b5\u03bd\u03ce \u03ba\u03b1\u03c4\u03b5\u03c5\u03b8\u03cd\u03bd\u03b5\u03c4\u03b1\u03b9 \u03c0\u03c1\u03bf\u03c2 \u03c4\u03b1 \u03b4\u03b5\u03be\u03b9\u03ac (\u03b1\u03bd\u03b1\u03c4\u03bf\u03bb\u03b9\u03ba\u03ac), \
\u03c0\u03c1\u03ad\u03c0\u03b5\u03b9 \u03c0\u03ac\u03bd\u03c4\u03b1 \u03bd\u03b1 \u03c3\u03c4\u03c1\u03af\u03b2\u03b5\u03b9 \u03b1\u03c1\u03b9\u03c3\u03c4\u03b5\u03c1\u03ac \u03ba\u03b1\u03b9 \u03cc\u03c4\u03b1\u03bd \u03b2\u03bb\u03ad\u03c0\u03b5\u03b9 \u03ad\u03bd\u03b1\u03bd \u03c4\u03bf\u03af\u03c7\u03bf \u03b5\u03bd\u03ce \u03ba\u03b1\u03c4\u03b5\u03c5\u03b8\u03cd\u03bd\u03b5\u03c4\u03b1\u03b9 \u03c0\u03c1\u03bf\u03c2 \u03c4\u03b1 \u03c0\u03ac\u03bd\u03c9 \
(\u03b2\u03cc\u03c1\u03b5\u03b9\u03b1), \u03c7\u03c1\u03b5\u03b9\u03ac\u03b6\u03b5\u03c4\u03b1\u03b9 \u03c0\u03ac\u03bd\u03c4\u03b1 \u03bd\u03b1 \u03c3\u03c4\u03c1\u03af\u03b2\u03b5\u03b9 \u03b4\u03b5\u03be\u03b9\u03ac. \u039a\u03b1\u03b9 \u03b4\u03b5\u03bd \u03ba\u03b1\u03c4\u03b5\u03c5\u03b8\u03cd\u03bd\u03b5\u03c4\u03b1\u03b9 \u03c0\u03bf\u03c4\u03ad \u03c0\u03c1\u03bf\u03c2 \u03ac\u03bb\u03bb\u03b7 \u03ba\u03b1\u03c4\u03b5\u03cd\u03b8\u03c5\u03bd\u03c3\u03b7. \
\u0394\u03b7\u03bc\u03b9\u03bf\u03cd\u03c1\u03b3\u03b7\u03c3\u03b5 \u03bb\u03bf\u03b9\u03c0\u03cc\u03bd \u03ad\u03bd\u03b1 \u03c0\u03c1\u03cc\u03b3\u03c1\u03b1\u03bc\u03bc\u03b1 \u03cc\u03c0\u03bf\u03c5 \u03b7 \u039a\u03ac\u03c1\u03bb\u03b1 \u03b8\u03b1 \u03c0\u03b7\u03b3\u03b1\u03af\u03bd\u03b5\u03b9 \u03b5\u03bc\u03c0\u03c1\u03cc\u03c2 \u03bc\u03ad\u03c7\u03c1\u03b9 \u03cc\u03c4\u03bf\u03c5 \u03bd\u03b1 \u03b4\u03b5\u03b9 \u03ad\u03bd\u03b1\u03bd \u03c4\u03bf\u03af\u03c7\u03bf \u03ba\u03b1\u03b9 \
\u03bc\u03b5\u03c4\u03ac \u03c3\u03c4\u03c1\u03af\u03b2\u03b5\u03b9 \u03b1\u03c1\u03b9\u03c3\u03c4\u03b5\u03c1\u03ac \u03b1\u03bd \u03ba\u03b1\u03c4\u03b5\u03c5\u03b8\u03cd\u03bd\u03b5\u03c4\u03b1\u03b9 \u03c0\u03c1\u03bf\u03c2 \u03c4\u03b1 \u03b1\u03bd\u03b1\u03c4\u03bf\u03bb\u03b9\u03ba\u03ac, \u03ba\u03b1\u03b9 \u03c0\u03c1\u03bf\u03c2 \u03c4\u03b1 \u03b4\u03b5\u03be\u03b9\u03ac \u03b4\u03b9\u03b1\u03c6\u03bf\u03c1\u03b5\u03c4\u03b9\u03ba\u03ac.
DESC_09=<p>\u0391\u03b1, \u03c3\u03c4\u03c1\u03b9\u03bc\u03ce\u03c7\u03b8\u03b7\u03ba\u03b1 \u03c3\u03c4\u03bf\u03c5\u03c2 \u03c3\u03c4\u03b5\u03bd\u03bf\u03cd\u03c2 \u03b4\u03b9\u03b1\u03b4\u03c1\u03cc\u03bc\u03bf\u03c5\u03c2, \u03b5\u03c5\u03c7\u03b1\u03c1\u03b9\u03c3\u03c4\u03ce! \u0391\u03bb\u03bb\u03ac \u03c6\u03b1\u03af\u03bd\u03b5\u03c4\u03b1\u03b9 \u03cc\u03c4\u03b9 \u03c0\u03b5\u03c1\u03b9\u03c3\u03c3\u03cc\u03c4\u03b5\u03c1\u03bf\u03b9 \u03b4\u03b9\u03ac\u03b4\u03c1\u03bf\u03bc\u03bf\u03b9 \
\u03b5\u03af\u03bd\u03b1\u03b9 \u03bc\u03c0\u03c1\u03bf\u03c3\u03c4\u03ac, \u03ba\u03b1\u03b9 \u03b1\u03c5\u03c4\u03ae \u03c4\u03b7 \u03c6\u03bf\u03c1\u03ac \u03b4\u03b5\u03bd \u03b5\u03af\u03bd\u03b1\u03b9 \u03c4\u03cc\u03c3\u03bf \u03b5\u03cd\u03ba\u03bf\u03bb\u03bf!</p>
HINT_09=<p>\u039b\u03ac\u03b2\u03b5\u03c4\u03b5 \u03c5\u03c0\u03cc\u03c8\u03b7 \u03cc\u03c4\u03b9 \u03b1\u03c5\u03c4\u03ae \u03c4\u03b7 \u03c6\u03bf\u03c1\u03ac, \u03bf\u03b9 \u03b4\u03b9\u03ac\u03b4\u03c1\u03bf\u03bc\u03bf\u03b9 \u03bf\u03b4\u03b7\u03b3\u03bf\u03cd\u03bd \u03c0\u03c1\u03bf\u03c2 \u03cc\u03bb\u03b5\u03c2 \u03c4\u03b9\u03c2 \u03ba\u03b1\u03c4\u03b5\u03c5\u03b8\u03cd\u03bd\u03c3\u03b5\u03b9\u03c2. \
\u0397 \u039a\u03ac\u03c1\u03bb\u03b1 \u03b8\u03b1 \u03c7\u03c1\u03b5\u03b9\u03b1\u03c3\u03c4\u03b5\u03af \u03bd\u03b1 \u03c0\u03b7\u03b3\u03b1\u03af\u03bd\u03b5\u03c4\u03b5 \u03ba\u03b1\u03b9 \u03b1\u03c1\u03b9\u03c3\u03c4\u03b5\u03c1\u03ac \u03ba\u03b1\u03b9 \u03b4\u03b5\u03be\u03b9\u03ac, \u03ba\u03b1\u03b9 \u03c0\u03ac\u03bd\u03c9 \u03ba\u03b1\u03b9 \u03ba\u03ac\u03c4\u03c9. \
\u03a5\u03c0\u03ac\u03c1\u03c7\u03bf\u03c5\u03bd \u03b1\u03ba\u03cc\u03bc\u03b1 \u03ba\u03ac\u03c0\u03bf\u03b9\u03b1 \u03c0\u03b9\u03bf \u03c6\u03b1\u03c1\u03b4\u03b9\u03ac \u03bc\u03ad\u03c1\u03b7 \u03c4\u03c9\u03bd \u03b4\u03b9\u03b1\u03b4\u03c1\u03cc\u03bc\u03c9\u03bd!</p>\
        <p>\u039f \u03c4\u03c1\u03cc\u03c0\u03bf\u03c2 \u03b3\u03b9\u03b1 \u03bd\u03b1 \u03b2\u03b3\u03b5\u03af\u03c4\u03b5 \u03b1\u03c0\u03cc \u03b1\u03c5\u03c4\u03cc\u03bd \u03c4\u03bf\u03bd \u03bb\u03b1\u03b2\u03cd\u03c1\u03b9\u03bd\u03b8\u03bf \u03b5\u03af\u03bd\u03b1\u03b9 \u03bd\u03b1 \u03c4\u03bf\u03bd \u03c0\u03b5\u03c1\u03c0\u03b1\u03c4\u03ae\u03c3\u03b5\u03c4\u03b5 \
\u03bc\u03b5 \u03c4\u03bf \u03b4\u03b5\u03be\u03af (\u03ae \u03c4\u03bf \u03b1\u03c1\u03b9\u03c3\u03c4\u03b5\u03c1\u03cc) \u03c7\u03ad\u03c1\u03b9 \u03c3\u03c4\u03bf\u03bd \u03c4\u03bf\u03af\u03c7\u03bf.</p>\
        <p>\u03a3\u03b7\u03bc\u03b5\u03af\u03c9\u03c3\u03b5 \u03cc\u03c4\u03b9 \u03b7 \u039a\u03ac\u03c1\u03bb\u03b1 \u03b4\u03b5\u03bd \u03bc\u03c0\u03bf\u03c1\u03b5\u03af \u03bd\u03b1 \u03b5\u03bb\u03ad\u03b3\u03be\u03b5\u03b9 \u03b1\u03c0\u03b5\u03c5\u03b8\u03b5\u03af\u03b1\u03c2 \u03b5\u03ac\u03bd \u03b2\u03c1\u03af\u03c3\u03ba\u03b5\u03c4\u03b1\u03b9 \u03b4\u03af\u03c0\u03bb\u03b1 \u03c4\u03b7\u03c2 \u03ad\u03bd\u03b1\u03c2 \u03c4\u03bf\u03af\u03c7\u03bf\u03c2 \u03c3\u03c4\u03bf \u03c3\u03c9\u03c3\u03c4\u03cc \u03bc\u03ad\u03b3\u03b5\u03b8\u03bf\u03c2, \
\u03bc\u03c0\u03bf\u03c1\u03b5\u03af \u03bc\u03cc\u03bd\u03bf \u03bd\u03b1 \u03b5\u03bb\u03ad\u03b3\u03be\u03b5\u03b9 \u03b1\u03bd \u03c5\u03c0\u03ac\u03c1\u03c7\u03b5\u03b9 \u03ad\u03bd\u03b1\u03c2 \u03c4\u03bf\u03af\u03c7\u03bf\u03c2 \u03b1\u03ba\u03c1\u03b9\u03b2\u03ce\u03c2 \u03bc\u03c0\u03c1\u03bf\u03c3\u03c4\u03ac \u03c4\u03b7\u03c2 \u03c0\u03c1\u03bf\u03c2 \u03c4\u03b7\u03bd \u03ba\u03b1\u03c4\u03b5\u03cd\u03b8\u03c5\u03bd\u03c3\u03b7 \
\u03c0\u03bf\u03c5 \u03ba\u03b1\u03c4\u03b5\u03c5\u03b8\u03cd\u03bd\u03b5\u03c4\u03b1\u03b9. \u0391\u03bb\u03bb\u03ac \u03bc\u03c0\u03bf\u03c1\u03b5\u03af \u03bd\u03b1 \u03c3\u03c4\u03c1\u03af\u03c8\u03b5\u03b9 \u03b4\u03b5\u03be\u03b9\u03ac \u03ba\u03b1\u03b9 \u03bd\u03b1 \u03ba\u03bf\u03b9\u03c4\u03ac\u03be\u03b5\u03b9 \u03b1\u03bd \u03c5\u03c0\u03ac\u03c1\u03c7\u03b5\u03b9 \u03c4\u03bf\u03af\u03c7\u03bf\u03c2.</p>\
        <p>\u03a3\u03b7\u03bc\u03b5\u03af\u03c9\u03c3\u03b5 \u03b5\u03c0\u03af\u03c3\u03b7\u03c2 \u03cc\u03c4\u03b9 \u03b1\u03c1\u03c7\u03b9\u03ba\u03ac, \u03b7 \u039a\u03ac\u03c1\u03bb\u03b1 \u03ad\u03c7\u03b5\u03b9 \u03ad\u03bd\u03b1\u03bd \u03c4\u03bf\u03af\u03c7\u03bf \u03b4\u03af\u03c0\u03bb\u03b1 \u03c4\u03b7\u03c2 \u03c3\u03c4\u03b1 \u03b4\u03b5\u03be\u03b9\u03ac.<p>\
        <p>\u038c\u03c4\u03b1\u03bd \u03b7 \u039a\u03ac\u03c1\u03bb\u03b1 \u03ad\u03c7\u03b5\u03b9 \u03ad\u03bd\u03b1\u03bd \u03c4\u03bf\u03af\u03c7\u03bf \u03b4\u03af\u03c0\u03bb\u03b1 \u03c4\u03b7\u03c2 \u03c3\u03c4\u03b1 \u03b4\u03b5\u03be\u03b9\u03ac, \u03ba\u03b1\u03b9 \u03b4\u03b5\u03bd \u03c5\u03c0\u03ac\u03c1\u03c7\u03b5\u03b9 \u03c4\u03af\u03c0\u03bf\u03c4\u03b1 \u03bc\u03c0\u03c1\u03bf\u03c3\u03c4\u03ac \u03c4\u03b7\u03c2, \
\u03bc\u03c0\u03bf\u03c1\u03b5\u03af \u03bd\u03b1 \u03ba\u03ac\u03bd\u03b5\u03b9 \u03ad\u03bd\u03b1 \u03b2\u03ae\u03bc\u03b1. \u039a\u03b1\u03b9 \u03c4\u03cc\u03c4\u03b5 \u03c0\u03c1\u03ad\u03c0\u03b5\u03b9 \u03bd\u03b1 \u03b4\u03b9\u03b1\u03c3\u03c6\u03b1\u03bb\u03af\u03c3\u03b5\u03b9 \u03cc\u03c4\u03b9 \u03bf \u03c0\u03c1\u03bf\u03c3\u03b1\u03bd\u03b1\u03c4\u03bf\u03bb\u03b9\u03c3\u03bc\u03cc\u03c2 \u03c4\u03b7\u03c2 \u03b5\u03af\u03bd\u03b1\u03b9 \u03c4\u03ad\u03c4\u03bf\u03b9\u03bf\u03c2 \u03ce\u03c3\u03c4\u03b5 \
\u03bd\u03b1 \u03c5\u03c0\u03ac\u03c1\u03c7\u03b5\u03b9 \u03ad\u03bd\u03b1\u03c2 \u03c4\u03bf\u03af\u03c7\u03bf\u03c2 \u03c3\u03c4\u03bf \u03c3\u03c9\u03c3\u03c4\u03cc \u03c4\u03b7\u03c2 \u03bc\u03ad\u03b3\u03b5\u03b8\u03bf\u03c2. \u0394\u03b5\u03b4\u03bf\u03bc\u03ad\u03bd\u03bf\u03c5 \u03cc\u03c4\u03b9 \u03bc\u03cc\u03bb\u03b9\u03c2 \u03ad\u03ba\u03b1\u03bd\u03b5 \u03ad\u03bd\u03b1 \u03b2\u03ae\u03bc\u03b1 \u03cc\u03c4\u03b1\u03bd \u03b5\u03af\u03c7\u03b5 \u03ad\u03bd\u03b1 \
\u03c4\u03bf\u03af\u03c7\u03bf \u03c3\u03c4\u03b1 \u03b4\u03b5\u03be\u03b9\u03ac \u03c4\u03b7\u03c2, \u03b1\u03c1\u03ba\u03b5\u03af \u03bd\u03b1 \u03c3\u03c4\u03c1\u03af\u03c8\u03b5\u03b9 \u03b4\u03b5\u03be\u03b9\u03ac \u03ba\u03b1\u03b9 \u03bc\u03b5\u03c4\u03ac \u03b1\u03c1\u03b9\u03c3\u03c4\u03b5\u03c1\u03ac \u03cc\u03c3\u03bf \u03c5\u03c0\u03ac\u03c1\u03c7\u03b5\u03b9 \
\u03ad\u03bd\u03b1\u03c2 \u03c4\u03bf\u03af\u03c7\u03bf\u03c2 \u03bc\u03c0\u03c1\u03bf\u03c3\u03c4\u03ac \u03c4\u03b7\u03c2. \u039c\u03b5\u03c4\u03ac \u03bc\u03c0\u03bf\u03c1\u03b5\u03af \u03bd\u03b1 \u03be\u03b5\u03ba\u03b9\u03bd\u03ae\u03c3\u03b5\u03b9 \u03b1\u03c0\u03cc \u03c4\u03b7\u03bd \u03b1\u03c1\u03c7\u03ae, \u03ba\u03ac\u03bd\u03bf\u03bd\u03c4\u03b1\u03c2 \u03ad\u03bd\u03b1 \u03b2\u03ae\u03bc\u03b1 \u03ba\u03b1\u03b9 \
\u03bd\u03b1 \u03b5\u03c0\u03b1\u03bd\u03b1\u03c0\u03c1\u03bf\u03c3\u03b1\u03bd\u03b1\u03c4\u03bf\u03bb\u03b9\u03c3\u03c4\u03b5\u03af \u03ad\u03c4\u03c3\u03b9 \u03ce\u03c3\u03c4\u03b5 \u03bd\u03b1 \u03c5\u03c0\u03ac\u03c1\u03c7\u03b5\u03b9 \u03ad\u03bd\u03b1\u03c2 \u03c4\u03bf\u03af\u03c7\u03bf\u03c2 \u03c3\u03c4\u03b7 \u03b4\u03b5\u03be\u03b9\u03ac \u03c0\u03bb\u03b5\u03c5\u03c1\u03ac \u03c4\u03b7\u03c2, \u03bc\u03ad\u03c7\u03c1\u03b9 \u03bd\u03b1 \u03c6\u03c4\u03ac\u03c3\u03b5\u03b9 \u03c3\u03c4\u03b7\u03bd \u03ad\u03be\u03bf\u03b4\u03bf.</p>
DESC_10=<p>\u0391\u03c5\u03c4\u03cc \u03ae\u03c4\u03b1\u03bd \u03b4\u03cd\u03c3\u03ba\u03bf\u03bb\u03bf, \u03b5\u03c5\u03c7\u03b1\u03c1\u03b9\u03c3\u03c4\u03ce \u03c0\u03bf\u03c5 \u03bc\u03b5 \u03ba\u03b1\u03b8\u03bf\u03b4\u03ae\u03b3\u03b7\u03c3\u03b5\u03c2! \u0391\u03c5\u03c4\u03ae \u03c4\u03b7 \u03c6\u03bf\u03c1\u03ac \u03c6\u03b1\u03af\u03bd\u03b5\u03c4\u03b1\u03b9 \
\u03cc\u03c4\u03b9 \u03b5\u03af\u03bc\u03b1\u03b9 \u03c3\u03c4\u03b7 \u03bc\u03ad\u03c3\u03b7 \u03b5\u03bd\u03cc\u03c2 \u03b4\u03c9\u03bc\u03b1\u03c4\u03af\u03bf\u03c5! \u0391\u03bb\u03bb\u03ac, \u03c0\u03b9\u03c3\u03c4\u03b5\u03cd\u03c9 \u03cc\u03c4\u03b9 \u03b1\u03c5\u03c4\u03cc \u03bc\u03c0\u03bf\u03c1\u03b5\u03af \u03bd\u03b1 \u03b5\u03af\u03bd\u03b1\u03b9 \u03c4\u03bf \u03c4\u03b5\u03bb\u03b5\u03c5\u03c4\u03b1\u03af\u03bf \u03c3\u03cd\u03bd\u03bf\u03bb\u03bf \u03b4\u03c9\u03bc\u03b1\u03c4\u03af\u03c9\u03bd - \
\u03bc\u03c0\u03bf\u03c1\u03b5\u03af \u03bd\u03b1 \u03b5\u03af\u03bc\u03b1\u03b9 \u03c3\u03c7\u03b5\u03b4\u03cc\u03bd \u03ad\u03be\u03c9!</p>
HINT_10=<p>\u0391\u03c5\u03c4\u03ae \u03c4\u03b7 \u03c6\u03bf\u03c1\u03ac, \u03b7 \u039a\u03ac\u03c1\u03bb\u03b1 \u03b2\u03c1\u03af\u03c3\u03ba\u03b5\u03c4\u03b1\u03b9 \u03c3\u03c4\u03b7 \u03bc\u03ad\u03c3\u03b7 \u03b5\u03bd\u03cc\u03c2 \u03ba\u03b5\u03bd\u03bf\u03cd \u03c7\u03ce\u03c1\u03bf\u03c5 \u03ba\u03b1\u03b9 \u03c5\u03c0\u03ac\u03c1\u03c7\u03b5\u03b9 \u03ad\u03bd\u03b1\u03c2 \u03bb\u03b1\u03b2\u03cd\u03c1\u03b9\u03bd\u03b8\u03bf\u03c2 \
\u03c0\u03c1\u03bf\u03c2 \u03c4\u03b7\u03bd \u03ad\u03be\u03bf\u03b4\u03bf. \u03a3\u03c4\u03bf \u03c0\u03c1\u03bf\u03b7\u03b3\u03bf\u03cd\u03bc\u03b5\u03bd\u03bf \u03c3\u03cd\u03bd\u03bf\u03bb\u03bf \u03b4\u03c9\u03bc\u03b1\u03c4\u03af\u03c9\u03bd, \u03b7 \u039a\u03ac\u03c1\u03bb\u03b1 \u03ad\u03bc\u03b1\u03b8\u03b5 \u03bd\u03b1 \u03b2\u03c1\u03af\u03c3\u03ba\u03b5\u03b9 \u03c4\u03b7\u03bd \u03ad\u03be\u03bf\u03b4\u03bf \
\u03cc\u03c4\u03b1\u03bd \u03be\u03b5\u03ba\u03b9\u03bd\u03ac \u03bc\u03b5 \u03ad\u03bd\u03b1\u03bd \u03c4\u03bf\u03af\u03c7\u03bf \u03c3\u03c4\u03b7 \u03b4\u03b5\u03be\u03b9\u03ac \u03c0\u03bb\u03b5\u03c5\u03c1\u03ac \u03c4\u03b7\u03c2 (\u03ba\u03b1\u03b9 \u03ba\u03b5\u03bd\u03cc \u03c7\u03ce\u03c1\u03bf \u03bc\u03c0\u03c1\u03bf\u03c3\u03c4\u03ac \u03c4\u03b7\u03c2). \
\u0391\u03c2 \u03c7\u03c4\u03af\u03c3\u03bf\u03c5\u03bc\u03b5 \u03c0\u03ac\u03bd\u03c9 \u03c3\u03b5 \u03b1\u03c5\u03c4\u03cc - \u03bc\u03ac\u03b8\u03b5 \u03c4\u03b7\u03bd \u039a\u03ac\u03c1\u03bb\u03b1 \u03bd\u03b1 \u03c6\u03c4\u03ac\u03c3\u03b5\u03b9 \u03c3\u03b5 \u03b1\u03c5\u03c4\u03ae\u03bd \u03c4\u03b7\u03bd \u03ba\u03b1\u03c4\u03ac\u03c3\u03c4\u03b1\u03c3\u03b7 \u03b1\u03c0\u03cc \u03ad\u03bd\u03b1\u03bd \u03ba\u03b5\u03bd\u03cc \u03c7\u03ce\u03c1\u03bf.</p>\
<p>\u0391\u03c5\u03c4\u03cc \u03bc\u03c0\u03bf\u03c1\u03b5\u03af \u03bd\u03b1 \u03b3\u03af\u03bd\u03b5\u03b9 \u03b1\u03c0\u03bb\u03ac \u03c0\u03b5\u03c1\u03c0\u03b1\u03c4\u03ce\u03bd\u03c4\u03b1\u03c2 \u03b7 \u039a\u03ac\u03c1\u03bb\u03b1 \u03bc\u03ad\u03c7\u03c1\u03b9 \u03bd\u03b1 \u03b4\u03b5\u03b9 \u03ad\u03bd\u03b1\u03bd \u03c4\u03bf\u03af\u03c7\u03bf \u03ba\u03b1\u03b9 \u03bc\u03b5\u03c4\u03ac \u03bd\u03b1 \u03c3\u03c4\u03c1\u03af\u03b2\u03b5\u03b9 \u03b1\u03c1\u03b9\u03c3\u03c4\u03b5\u03c1\u03ac \
\u03cc\u03c3\u03bf \u03b7 \u039a\u03ac\u03c1\u03bb\u03b1 \u03b2\u03bb\u03ad\u03c0\u03b5\u03b9 \u03ad\u03bd\u03b1\u03bd \u03c4\u03bf\u03af\u03c7\u03bf. \u03a3\u03c4\u03b7 \u03c3\u03c5\u03bd\u03ad\u03c7\u03b5\u03b9\u03b1, \u03b1\u03c0\u03bb\u03ce\u03c2 \u03ba\u03ac\u03bb\u03b5\u03c3\u03b5 \u03c4\u03b7\u03bd \u03b5\u03bd\u03c4\u03bf\u03bb\u03ae \u03b1\u03c0\u03cc \u03c4\u03bf \u03c0\u03c1\u03bf\u03b7\u03b3\u03bf\u03cd\u03bc\u03b5\u03bd\u03bf \
\u03c3\u03cd\u03bd\u03bf\u03bb\u03bf \u03b4\u03c9\u03bc\u03b1\u03c4\u03af\u03c9\u03bd \u03b3\u03b9\u03b1 \u03c4\u03b7\u03bd \u03ba\u03b1\u03b8\u03bf\u03b4\u03ae\u03b3\u03b7\u03c3\u03b7 \u03c3\u03c4\u03b7\u03bd \u03ad\u03be\u03bf\u03b4\u03bf!</p>
DESC_99=<p>\u03a6\u03b1\u03bd\u03c4\u03b1\u03c3\u03c4\u03b9\u03ba\u03ac, \u03b5\u03af\u03bc\u03b1\u03b9 \u03ad\u03be\u03c9 \u03c4\u03ce\u03c1\u03b1. \u0395\u03c5\u03c7\u03b1\u03c1\u03b9\u03c3\u03c4\u03ce \u03c0\u03bf\u03c5 \u03bc\u03b5 \u03b5\u03bb\u03b5\u03c5\u03b8\u03ad\u03c1\u03c9\u03c3\u03b5\u03c2!</p>\
        <p>\u0394\u03ce\u03c3\u03b5 \u03bc\u03bf\u03c5 \u03bc\u03b5\u03c1\u03b9\u03ba\u03ad\u03c2 \u03b5\u03bd\u03c4\u03bf\u03bb\u03ad\u03c2 \u03b3\u03b9\u03b1 \u03bd\u03b1 \u03b3\u03c5\u03c1\u03af\u03c3\u03c9 \u03c4\u03c1\u03b9\u03b3\u03cd\u03c1\u03c9!</p>
HINT_99=

COMMAND_turn-back=\u03b3\u03cd\u03c1\u03bd\u03b1-\u03c0\u03af\u03c3\u03c9
COMMAND_turn-right=\u03b3\u03cd\u03c1\u03bd\u03b1-\u03b4\u03b5\u03be\u03b9\u03ac
COMMAND_two-steps=\u03b4\u03c5\u03bf-\u03b2\u03ae\u03bc\u03b1\u03c4\u03b1
COMMAND_six-steps=\u03ad\u03be\u03b9-\u03b2\u03ae\u03bc\u03b1\u03c4\u03b1
COMMAND_walk-turn-walk=\u03c0\u03b5\u03c1\u03c0\u03ac\u03c4\u03b1-\u03c3\u03c4\u03c1\u03af\u03c8\u03b5-\u03c0\u03b5\u03c1\u03c0\u03ac\u03c4\u03b1
COMMAND_check-walk-turn-walk=\u03ad\u03bb\u03b5\u03b3\u03be\u03b5-\u03c0\u03b5\u03c1\u03c0\u03ac\u03c4\u03b1-\u03c3\u03c4\u03c1\u03af\u03c8\u03b5-\u03c0\u03b5\u03c1\u03c0\u03ac\u03c4\u03b1
COMMAND_freeform=\u03b5\u03bb\u03b5\u03cd\u03b8\u03b5\u03c1\u03b7-\u03bc\u03bf\u03c1\u03c6\u03ae
