#
# Karel
# Copyright (C) 2014-2015 Jaroslav Tulach <jaroslav.tulach@apidesign.org>
#
# This program is free software: you can redistribute it and/or modify
# it under the terms of the GNU General Public License as published by
# the Free Software Foundation, version 2 of the License.
#
# This program is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
# GNU General Public License for more details.
#
# You should have received a copy of the GNU General Public License
# along with this program. Look for COPYING file in the top folder.
# If not, see http://opensource.org/licenses/GPL-2.0.
#


HARDCODED_StartText=Robotka Karla se ztralila v obrovsk\u00e9 budov\u011b, a pot\u0159ebuje tvoji pomoc aby se dostala ven. Pom\u016f\u017ee\u0161 j\u00ed?
HARDCODED_StartCommand=Jdu na to!
HARDCODED_TryAgain=Zkus\u00edm to znova
HARDCODED_NextRoom=Dal\u0161\u00ed mistnost &raquo;
HARDCODED_Go=Za\u010dni
HARDCODED_GoHint=(spust program jm\u00e9nem {0})
HARDCODED_Stop=Stop
HARDCODED_GiveUp=Vyd\u00e1v\u00e1m se, uka\u017e mi \u0159e\u0161en\u00ed, pros\u00edm!

Error_Wall=<strong>Auu!</strong> Vrazila jsem do zdi!
Error_NoMarks=<strong>Pozor!</strong> Nelze sebrat zna\u010dku!
Error_TooManyMarks=<strong>Pozor!</strong> P\u0159\u00edli\u0161 mnoho zna\u010dek!
Error_UnknowCommand=<strong>Pozor!</strong> Nezn\u00e1m\u00fd p\u0159\u00edkaz {0}!
Error_unknown=<strong>Pozor!</strong> Nezn\u00e1m\u00e1 chyba!

DESC_00=<p>Pot\u0159ebuju Tvoji pomoc!</p>\
        <p>Jsem robotka Karla, a ztratila jsem se v t\u00e9hle budov\u011b. Moje naviga\u010dn\u00ed\
        obvody nefunnguj\u00ed, tak\u017ee se nev\u00edm kudy se dostat ven.</p>\
        <p>Mohl(a) bys pros\u00edm pou\u017e\u00edt p\u0159\u00edkazy a dov\u00e9st m\u011b k v\u00fdchodu?</p>
HINT_00=Pou\u017eij p\u0159\u00edkazy 'vlevo-vbok' a 'krok' a dove\u010f Karla k v\u00fdchodu. \
        D\u00e1vej pozor - Karla nesm\u00ed vrazit do zdi!
DESC_01=<p>Uff, d\u00edky, \u017ee jsi mi pomohl z t\u00e9 m\u00edstnosti.</p>\
        <p>Te\u010f jsem v jin\u00e9 mistnosti, a ob\u00e1v\u00e1m se, \u017ee budu pot\u0159ebovat Tvoji pomoc \
        nejenom abych se dostala z t\u00e9hle m\u00edstosti, ale z cel\u00e9 \u0159ady m\u00edstost\u00ed, abych \
        se dostala ven z cel\u00e9 t\u00e9to budovy.</p>\
        <p>Nav\u00edc se zd\u00e1, \u017ee je tu te\u010f spousta ru\u0161en\u00ed, tak\u017ee u\u017e mi bohu\u017eel nem\u016f\u017ee\u0161 \
        d\u00e1vat p\u0159\u00edkazy jeden ya druh\u00fdm. Pot\u0159ebovala bych, abys mi dal(a) cel\u00fd seznam \
        p\u0159\u00edkaz\u016f, kter\u00e9 budu moct prov\u00e9st.</p>\
        <p>Na\u0161t\u011bst\u00ed, i kdy\u017e je tu to ru\u0161en\u00ed, po\u0159\u00e1d je\u0161t\u011b vid\u00edm dob\u0159e. \
        Posta\u010d\u00ed tedy, kdy\u017e budu st\u00e1t hned vedle v\u00fdchodu, a budu se na n\u011bj d\u00edvat. \
        </p>
HINT_01=V\u0161imni si, \u017ee v\u00fdchod je hned za Karlou. Oto\u010d ji tedy \u010delem vzad. \
        Aby se oto\u010dila \u010delem vzad, je pot\u0159eba, aby se oto\u010dila dvakr\u00e1t doleva. \
        Vypl\u0148 p\u0159edvytvo\u0159en\u00fd program '\u010delem-vzad', a pak zm\u00e1\u010dkni tla\u010d\u00edtko 'Za\u010dni'
DESC_02=Ufff, d\u00edky! Dal\u0161\u00ed m\u00edstnost, stejn\u00fd \u00fakol jako posledn\u011b. M\u016f\u017ee\u0161 m\u011b, pros\u00edm, \
        oto\u010dit, tak, abych se d\u00edvala na v\u00fdchod?
HINT_02=V\u0161imni si, \u017ee v\u00fdchod ve po Karlin\u011b prav\u00e9 ruce. Karla ale nem\u00e1 p\u0159\u00edkaz na\
        oto\u010den\u00ed doprava! Bude\u0161 tedy muset oto\u010den\u00ed doprava Karlu nau\u010dit. Kdy\u017e se nad t\u00edm \
        zamysl\u00ed\u0161, oto\u010den\u00ed doprava je do sam\u00e9, jako t\u0159ikr\u00e1t oto\u010den\u00ed doleva. Tak\u017ee \
        v p\u0159\u00edkazu 'vpravo-vbok' mu\u017ee\u0161 Karle r\u00edct, aby se t\u0159ikr\u00e1t oto\u010dila doleva. \
        Nebo m\u016f\u017ee\u0161 pou\u017e\u00edt '\u010delem-vzad' z minul\u00e9 m\u00edstosti, a oto\u010dit Karlu \u010delem vzad \
        a potom jednou doleva.
DESC_03=<p>Ohhh, dal\u0161\u00ed m\u00edstnost! D\u00edky za dosavadn\u00ed pomoc!</p>\
         <p>Ob\u00e1v\u00e1m se, \u017ee to ru\u0161en\u00ed zesiluje. Zrak u\u017e mi moc nefunguje. Ur\u010dit\u011b \
         se to zlep\u0161\u00ed, a\u017e se odsud dostanu ven. Ale prozat\u00edm se m\u011b bohu\u017eel bude\u0161 \
         muset nav\u00e9st tak, \u017ee budu na v\u00fdchod\u011b z m\u00edstnosti st\u00e1t, nejenom se na n\u011bj d\u00edvat.</p>
HINT_03=V\u00fdchod je o dva \u0159\u00e1dky p\u0159ed Karlou. Sta\u010d\u00ed definovat p\u0159\u00edkaz, \u017ee m\u00e1 ud\u011blat \
        dva kroky.
DESC_04=D\u00edky, \u017ee jsi m\u011b provedl(a) p\u0159es tu p\u0159edch\u00e1zej\u00edc\u00ed m\u00edstnost! M\u016f\u017ee\u0161 m\u011b, pros\u00edm, \
        prov\u00e9st touhle i m\u00edstnost\u00ed?
HINT_04=Tato m\u00edstnost je velmi podobn\u00e1 t\u00e9 p\u0159edchoz\u00ed. Karla mus\u00ed j\u00edt pouze dop\u0159edu. \
        Rozd\u00edl je v tom, \u017ee v\u00fdchod je ve v\u011bt\u0161\u00ed vzd\u00e1lenosti. Mohli bychom pou\u017e\u00edt \
        p\u0159\u00edkaz 'krok' \u0161estkr\u00e1t, ale pou\u017eijme rad\u011bji p\u0159\u00edkaz 'opakuj', na nechme Karlu \
        samotnou zopakovat p\u0159\u00edkaz 'krok' 6-kr\u00e1t.
DESC_05=<p>Uff, dal\u0161\u00ed m\u00edstnost je za mnou, diky!</p>\
        <p>Pomo\u017e mi tak\u00e9 p\u0159es tuhle m\u00edstnost, pros\u00edm!</p>
HINT_05=<p>V t\u00e9to m\u00edstnosti, Karla mus\u00ed j\u00edt kousek rovn\u011b, potom se oto\u010dit doprava, \
        a potom j\u00edt je\u0161t\u011b kousek rovn\u011b. Pou\u017eij, pros\u00edm, p\u0159\u00edkaz 'vpravo-vbok',\
        kter\u00fd jsme si ji\u017e nadefinovali, aby se Karla mohla oto\u010dit doprava.</p>\
        Tak\u00e9 by sis mohl(a) v\u0161imnout, \u017ee poka\u017ed\u00e9 kdy\u017e Karla mus\u00ed j\u00edt rovn\u011b, tak mus\u00ed \
        uj\u00edt p\u0159esn\u011b 6 krok\u016f - a u\u017e jsme j\u00ed nau\u010dili jak ud\u011blat \u0161est krok\u016f, tak pro\u010d to nevyu\u017e\u00edt?</p>
DESC_06=<p>To bylo skv\u011bl\u00e9, d\u00edky, \u017ee jsi m\u011b provedl(a) p\u0159es tu m\u00edstnost!</p>\
        <p>Bohu\u017eel m\u00e1me dal\u0161\u00ed problem: ru\u0161en\u00ed, o kter\u00e9m jsem mluvila, bude v n\u00e1sleduj\u00edc\u00edch \
        m\u00edstnostech moc siln\u00e9. Mohl(a) bys mi, pros\u00edm, poskytnout instrukce, kter\u00e9 \
        m\u011b provedou v\u0161emi t\u011bmito m\u00edstnostmi?</p>
HINT_06=<p>Karla mus\u00ed j\u00edt kousek rovn\u011b, oto\u010dit se doprava, a pak j\u00edt je\u0161t\u011b kousek rovn\u011b. \
        Na rozd\u00edl od p\u0159edchoz\u00edch m\u00edstnost\u00ed, mus\u00ed proj\u00edt p\u0159es n\u011bkolik m\u00edstnost\u00ed \
        s pou\u017eit\u00edm stejn\u00fdch instrukc\u00ed. \
        Uv\u011bdom si, \u017ee Karla nasm\u00ed narazit do zdi - mohla by se po\u0161kr\u00e1bat. \
        Pros\u00edm pou\u017eij p\u0159\u00edkaz 'dokud' s podm\u00ednkou 'ne-vid\u00ed ze\u010f', aby Karla do\u0161la a\u017e \
        t\u011bsn\u011b ke zdi. \
        Pak ji nech oto\u010dit. Pak m\u016f\u017ee\u0161 op\u011bt pou\u017e\u00edt p\u0159\u00edkaz 'dokud', tentokrat s podm\u00ednkou \
        'ne-stoj\u00ed na v\u00fdchod\u011b', abys ji dovedl(a) k v\u00fdchodu.</p>
#DESC_07=<p>Thanks for getting me through all those rooms! seems there's another \
#        set of rooms ahead of me, and this time the exit is in the middle of room!</p>
#HINT_07=
DESC_08=<p>D\u00edky, \u017ee jsi m\u011b dostal(a) p\u0159es v\u0161echny ty m\u00edstnosti, co jsme zat\u00edm zvl\u00e1dli! \
        Zd\u00e1 se, \u017ee te\u010f n\u00e1sleduje s\u00e9rie zato\u010den\u00fdch chodem. Tohle bude t\u011b\u017ek\u00e9!</p>
HINT_08=<p>Abychom Karlu provedli p\u0159es tyto chodby, budeme muset pou\u017e\u00edt v\u00edce podm\u00ednek \
        a smy\u010dku. Vytvo\u0159 smy\u010dku pomoc\u00ed 'dokud' s podm\u00ednkou 'ne-stoj\u00ed na v\u00fdchod\u011b'. \
        To zajist\u00ed, \u017ee Karla p\u016fjde dokud nedojde do v\u00fdchodu. \
        Univt\u0159 t\u00e9 smy\u010dky pot\u0159ebujeme p\u0159\u00edkazy, ktere pomohou Karle v\u00fdchod naj\u00edt. \
        V\u0161imni si, \u017ee ty chodby jsou velice snadn\u00e9 - kdy\u017e Karla vid\u00ed ze\u010f a d\u00edv\u00e1 \
        se doprava (v\u00fdchodn\u00edm sm\u011brem), tak se v\u017edy mus\u00ed oto\u010dit doleva. \
        Kdy\u017e vid\u00ed ze\u010f a d\u00edv\u00e1 se nahoru (na sever), tak se pot\u0159ebuje oto\u010dit doprava. \
        A nikdy se ned\u00edv\u00e1 \u017e\u00e1dn\u00fdm jin\u00fdm sm\u011brem.\
        Tak\u017ee uvnit\u0159 t\u00e9 smy\u010dky vytvo\u0159 p\u0159\u00edkazy, kde Karla p\u016fjde rovn\u011b doku uvid\u00ed ze\u010f, \
        a pak se oto\u010d\u00ed doleva, kdy\u017e se d\u00edv\u00e1 na v\u00fdchod, a jinak se oto\u010d\u00ed doprava.
DESC_09=<p>Uh, tak jsem se t\u011bmi chodbami s Tvoj\u00ed pomoc\u00ed prot\u00e1hla, d\u00edky! Vypad\u00e1 to, \u017ee \
         p\u0159ede mnou je v\u00edce chodem, a tentokr\u00e1t to nebude tak snadn\u00e9!</p>
HINT_09=<p>V\u0161imni si, \u017ee tentokr\u00e1t se tz chodby to\u010d\u00ed do v\u0161ech sm\u011br\u016f. Karla bude pot\u0159ebovat \
        chodit doleva i doprava, a nahoru i dol\u016f. N\u011bkter\u00e9 \u010d\u00e1sti t\u011bch chodeb jsou \
        i \u0161irok\u00e9!</p>\
        <p>Zp\u016fsob, jak proj\u00edt bludi\u0161t\u011bm tohoto typu je st\u00e1le j\u00edt s pravou \
        rukou na zdi. (Bylo by, samoz\u0159ejm\u011b, mo\u017en\u00e9 j\u00edt i s levou rukou na zdi. \
        Jenom b\u011bhem proch\u00e1zen\u00ed bludi\u0161t\u011b nesm\u00edme ruce st\u0159\u00eddat, a mus\u00edme pou\u017e\u00edvat \
        st\u00e1le stejnou ruku.)</p>\
        <p>Uv\u011bdom si, \u017ee Karla nem\u016f\u017ee p\u0159\u00edmo zjistit, jestli m\u00e1 ze\u010f po prav\u00e9 ruce, \u010di nikoliv, \
        ona m\u016f\u017ee jenom zjistit, \u017ee je ze\u010f p\u0159\u00edmo p\u0159ed n\u00ed, se sm\u011bru, ve kter\u00e9m je nato\u010den\u00e1. \
        Ale m\u016f\u017ee se nato\u010d\u00edt doprava, a pod\u00edvat se, jestli je tam ze\u010f.</p>\
        <p>Tak\u00e9 si v\u0161imni, \u017ee na za\u010d\u00e1tku m\u00e1 ve v\u0161echno chodb\u00e1ch Karla ze\u010f po prav\u00e9 ruce.<p>\
        <p>Kdy\u017e m\u00e1 Karla ze\u010f po prav\u00e9 ruce, a p\u0159ed n\u00ed nic nen\u00ed, m\u016f\u017ee ud\u011blat krok. \
        Pak mus\u00edme zajistit, \u017ee bude op\u011bt orientov\u00e1na tak, \u017ee bude m\u00edt ze\u010f po prav\u00e9 ruce. \
        Proto\u017ee p\u0159ed p\u0159edchoz\u00edm krokem m\u011bla ze\u010f po prav\u00e9 ruce, sta\u010d\u00ed, kdy\u017e se oto\u010d\u00ed doprava, \
        a pak se bude ot\u00e1\u010det doleva, dokud p\u0159ed n\u00ed bude ze\u010f. Zkus si ji p\u0159edstavit v r\u016fzn\u00fdch \
        m\u00edstech jej\u00ed dr\u00e1hy, aby ses p\u0159esv\u011bd\u010dil(a), \u017ee to funguje. Potom, co se takto \
        nato\u010d\u00ed m\u016f\u017ee pokra\u010dovat dal\u0161\u00edm krokem, pak se zase p\u0159eto\u010d\u00ed, jak bude pot\u0159eba, \
        a to po\u0159\u00e1d dokola, dokud nenajde v\u00fdchod.</p>
DESC_10=<p>To bylo te\u017ek\u00e9! D\u00edky, \u017ee jsi m\u011b provedl(a) skrz! Tentokr\u00e1t to vypad\u00e1, \u017ee \
        jsem uprost\u0159ed m\u00edstnosti! Ale c\u00edt\u00edm \u017ee bz to mohla b\u00fdt posledn\u00ed skupina m\u00edstnost\u00ed - \
        jsem skoro venku!</p>
HINT_10=<p>Tentokr\u00e1t je Karla uprost\u0159ed voln\u00e9ho prostoru, a pak je\u0161t\u011b mus\u00ed proj\u00edt bludi\u0161t\u011bm, \
        aby do\u0161la k v\u00fdchodu. V p\u0159edchoz\u00ed skupin\u011b m\u00edstnost\u00ed se Karla nau\u010dila naj\u00edt v\u00fdchod \
        pokud za\u010d\u00edn\u00e1 se zd\u00ed po jej\u00ed prav\u00e9 ruce (a voln\u00fdm prostorem p\u0159ed n\u00ed). \
        Poj\u010fme na tom stav\u011bt - nau\u010d Karlu dos\u00e1hnout stejn\u00e9ho stavu, kdz\u017e je ve voln\u00e9m prostoru.</p>\
        <p>To lze snadno dok\u00e1zat tak, \u017ee Karla p\u016fjde dokud neuviid\u00ed p\u0159ed sebou ze\u010f, a pak se \
        bude ot\u00e1\u010det doleva, pokud p\u0159ed n\u00ed bude ze\u010f. Pak m\u016f\u017ee pou\u017e\u00edt p\u0159\u00edkaz, kter\u00fd jsme j nau\u010dili v \
        p\u0159edchoz\u00edm kroku, aby se dostala z bludi\u0161t\u011b!</p>
DESC_99=<p>Hur\u00e1, jsem venku! D\u00edky za vysvobozen\u00ed!</p>\
        <p>Te\u010f m\u016f\u017ee\u0161 d\u00e1vat Karle p\u0159\u00edkazy jak\u00e9 chce\u0161!</p>
HINT_99=

COMMAND_turn-back=\u010delem-vzad
COMMAND_turn-right=vpravo-vbok
COMMAND_two-steps=dva-kroky
COMMAND_six-steps=\u0161est-krok\u016f
COMMAND_walk-turn-walk=jdi-oto\u010dse-jdi
COMMAND_check-walk-turn-walk=jdi-oto\u010dse-jdi-s-kontrolou
COMMAND_path-to-exit=cesta-k-v\u00fdchodu
COMMAND_find-exit=najdi-v\u00fdchod
COMMAND_find-exit-from-middle=najdi-v\u00fdchod-z-prost\u0159edka
COMMAND_freeform=freeform
